const questions_abhidharma_01 = [
  {
    "title": "බුදුන් වහන්සේ විසින් දේශනා කරන ලද ධර්මය කොටස් කීයකට බෙදා දැක්විය හැකිද?",
    "required": true,
    "points": 1,
    "index": 1,
    "choices": [
          {"text": "හතරකට", "isCorrect": false},
          {"text": "දෙකකට", "isCorrect": true},
          {"text": "තුනකට", "isCorrect": false},
          {"text": "එකකට", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ ධර්මය පිළිබඳ මූලික වර්ගීකරණය හොඳින් තේරුම් ගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. බුදුන් වහන්සේ විසින් දේශනා කරන ලද ධර්මය ධර්ම සහ විනය යනුවෙන් කොටස් දෙකකට බෙදා දැක්විය හැකිය. ධර්මය යනු සූත්‍ර පිටකය හා අභිධර්ම පිටකය වන අතර, විනය යනු භික්ෂූන්ගේ හැසිරීම් රටාව පිළිබඳ නීති රීති ඇතුළත් විනය පිටකයයි. ධර්මය බුදුන් වහන්සේගේ ඉගැන්වීම් හා දර්ශනය ඇතුළත් වන අතර, විනය සංඝයා තුළ විනය පවත්වා ගැනීමට අවශ්‍ය නීති රීති ඇතුළත් වේ. මෙම දෙක එකට ත්‍රිපිටකය සෑදේ."},
  {
    "title": "අභිධර්මය ඉගෙනීමේ වැදගත්කම කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 2,
    "choices": [
          {"text": "දාන මාන පිංකම් කිරීමට", "isCorrect": false},
          {"text": "බුද්ධ ධර්මය පිළිබඳ මනා දැනුමක් ලබා ගැනීමට", "isCorrect": true},
          {"text": "කර්ම විපාක ගැන දැන ගැනීමට", "isCorrect": false},
          {"text": "බුදු පිළිම වන්දනා කිරීමට", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ අභිධර්මයේ මූලික අරමුණ හොඳින් වටහාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. අභිධර්මය ඉගෙනීමෙන් බුද්ධ ධර්මය පිළිබඳ ගැඹුරු හා නිවැරදි අවබෝධයක් ලබා ගත හැකිය. එය ධර්මයේ සියුම් කරුණු හා සංකල්ප පැහැදිලි කරයි, එමගින් බෞද්ධ දර්ශනය පිළිබඳ සම්පූර්ණ අවබෝධයක් ලබා ගැනීමට උපකාරී වේ. අභිධර්මය මගින් චිත්ත, චෛතසික, රූප හා නිර්වාණ යන පරමාර්ථ ධර්ම පිළිබඳ විස්තරාත්මක විශ්ලේෂණයක් සපයයි. මෙය භාවනා අභ්‍යාස සඳහා ද ඉතා වැදගත් වන අතර, විදර්ශනා ඥානය වර්ධනය කර ගැනීමට උපකාරී වේ."},
  {
    "title": "පරමාර්ථ ධර්ම කීයක් ඇත්තේය?",
    "required": true,
    "points": 1,
    "index": 3,
    "choices": [
          {"text": "දෙකක්", "isCorrect": false},
          {"text": "තුනක්", "isCorrect": false},
          {"text": "හතරක්", "isCorrect": true},
          {"text": "පහක්", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ පරමාර්ථ ධර්ම සංඛ්‍යාව නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. පරමාර්ථ ධර්ම හතරක් ඇත: චිත්ත, චෛතසික, රූප, සහ නිර්වාණය. මෙම ධර්ම හතර සත්‍ය වශයෙන් පවතින අවසාන යථාර්ථයන් ලෙස සැලකේ. චිත්ත යනු සිත හෝ විඤ්ඤාණයයි. චෛතසික යනු සිත හා එකට පවතින මානසික සාධකයන් ය. රූප යනු භෞතික ධර්මයන් ය. නිර්වාණය යනු සියලු දුක්වලින් නිදහස් වූ අවසාන විමුක්ති තත්ත්වයයි. මෙම සිව්වැදෑරුම් පරමාර්ථ ධර්ම අවබෝධ කර ගැනීම බුදුදහමේ මූලික ඉලක්කයකි."},
  {
    "title": "පරමාර්ථ ධර්ම හා සම්මුති ධර්ම අතර ප්‍රධාන වෙනස කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 4,
    "choices": [
          {"text": "පරමාර්ථ ධර්ම නිර්වාණය ලබා ගැනීමට අවශ්‍ය වන අතර සම්මුති ධර්ම සංසාරයේ සැරිසැරීමට උපකාරී වේ", "isCorrect": false},
          {"text": "පරමාර්ථ ධර්ම කර්මය හා සම්බන්ධ වන අතර සම්මුති ධර්ම විපාක හා සම්බන්ධ වේ", "isCorrect": false},
          {"text": "පරමාර්ථ ධර්ම සාමාන්‍ය ජනයාට තේරුම් ගත හැකි අතර සම්මුති ධර්ම රහත්වරුන්ට පමණක් අවබෝධ කළ හැකිය", "isCorrect": false},
          {"text": "පරමාර්ථ ධර්ම සත්‍ය වශයෙන් පවතින අතර සම්මුති ධර්ම ව්‍යවහාරික භාවිතය සඳහා පමණක් යෙදේ", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! ඔබ පරමාර්ථ ධර්ම හා සම්මුති ධර්ම අතර ඇති මූලික වෙනස හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. පරමාර්ථ ධර්ම යනු සත්‍ය වශයෙන් පවතින, නොබෙදිය හැකි අවසාන යථාර්ථයන් වන අතර, සම්මුති ධර්ම යනු ව්‍යවහාරික භාවිතය සඳහා යොදා ගන්නා, නමුත් අවසාන විශ්ලේෂණයකදී සත්‍ය වශයෙන් නොපවතින සංකල්පයන්ය. උදාහරණයක් ලෙස, 'පුද්ගලයා' යන්න සම්මුති ධර්මයක් වන අතර, එය නාම රූප ධර්මයන්ගේ ඒකරාශියක් පමණි. පරමාර්ථ ධර්ම විදර්ශනා භාවනාවේදී අවධානයට ලක් කළ යුතු අතර, සම්මුති ධර්ම එදිනෙදා ව්‍යවහාරයේදී භාවිතා වේ. කෙසේ වෙතත්, දෙවර්ගයම බුදුදහමේ ඉගැන්වීම් තුළ වැදගත් ස්ථානයක් උසුලයි."},
  {
    "title": "චිත්තය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 5,
    "choices": [
          {"text": "අරමුණු දැන ගැනීමේ ක්‍රියාවලිය", "isCorrect": true},
          {"text": "තීරණ ගැනීමේ ක්‍රියාවලිය", "isCorrect": false},
          {"text": "මතක තබා ගැනීමේ ක්‍රියාවලිය", "isCorrect": false},
          {"text": "හිතීමේ ක්‍රියාවලිය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ චිත්තයේ මූලික ස්වභාවය නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. චිත්තය යනු අරමුණු දැන ගැනීමේ ක්‍රියාවලියයි. එය අරමුණු විඳීම, හඳුනා ගැනීම හා අවබෝධ කර ගැනීම සිදු කරයි. හිතීම, මතක තබා ගැනීම, හෝ තීරණ ගැනීම වැනි සංකීර්ණ මානසික ක්‍රියාවලීන් චිත්තය හා චෛතසික ධර්මයන්ගේ සංයෝගයෙන් සිදු වේ. චිත්තය ක්ෂණිකව පහළ වී නිරුද්ධ වන අතර, එක් චිත්තයක් අරමුණක් පමණක් දැන ගනී. චිත්තය පරමාර්ථ ධර්මයක් වන අතර, එය චෛතසික ධර්ම සමඟ සම්බන්ධ වී විවිධ මානසික ක්‍රියාකාරකම් සිදු කරයි."},
  {
    "title": "චිත්තයේ ප්‍රධාන ලක්ෂණය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 6,
    "choices": [
          {"text": "අරමුණු ප්‍රතික්ෂේප කිරීම", "isCorrect": false},
          {"text": "අරමුණු විශ්ලේෂණය කිරීම", "isCorrect": false},
          {"text": "අරමුණු මතක තබා ගැනීම", "isCorrect": false},
          {"text": "අරමුණු දැන ගැනීම", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! ඔබ චිත්තයේ මූලික කාර්යය නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. චිත්තයේ ප්‍රධාන ලක්ෂණය වන්නේ අරමුණු දැන ගැනීමයි. චිත්තය අරමුණු ග්‍රහණය කර ගනී, නමුත් එය මතක තබා ගැනීම, විශ්ලේෂණය කිරීම හෝ ප්‍රතික්ෂේප කිරීම වැනි සංකීර්ණ ක්‍රියා සිදු නොකරයි. මෙම අතිරේක ක්‍රියාවන් චෛතසික ධර්මයන්ගේ සහයෝගයෙන් සිදු වේ. චිත්තය ඉතා ක්ෂණිකව පවතින අතර, එක් චිත්තයක් එක් අරමුණක් පමණක් දැන ගනී. චිත්තය සහ චෛතසික ධර්මයන් එකට ක්‍රියා කිරීමෙන් තමයි අපි අත්විඳින සංකීර්ණ මානසික ක්‍රියාවලීන් සිදු වන්නේ."},
  {
    "title": "චිත්තක්ෂණයක් යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 7,
    "choices": [
          {"text": "එක් ජීවිතයක් තුළ ඇති වන චිත්ත සංඛ්‍යාව", "isCorrect": false},
          {"text": "එක් චිත්තයක් පවතින කාලය", "isCorrect": true},
          {"text": "එක් අරමුණක් සිතෙහි රැඳී පවතින කාලය", "isCorrect": false},
          {"text": "දිනක් තුළ ඇති වන සිතුවිලි ගණන", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ චිත්තක්ෂණය පිළිබඳ නිවැරදි අවබෝධයක් ලබා ඇත.",
    "feedbackIncorrect": "වැරදියි. චිත්තක්ෂණය යනු එක් චිත්තයක් පවතින ඉතා කෙටි කාලයයි. එය උප්පාද (උත්පත්තිය), ඨිති (පැවැත්ම), භංග (නිරෝධය) යන අවස්ථා තුනෙන් සමන්විත වේ. මෙය ඉතා කෙටි කාලයක් වන අතර, අසංඛ්‍ය චිත්තක්ෂණ ගණනාවක් එක් තත්පරයක් තුළ සිදු වේ. උදාහරණයක් ලෙස, ඇසිපිය හෙළන තරම් කෙටි කාලයක් තුළ බිලියන ගණනක චිත්තක්ෂණ සිදුවිය හැකි යැයි සැලකේ. මෙම සංකල්පය චිත්තයේ අනිත්‍යතාව හා ක්ෂණිකත්වය පෙන්නුම් කරයි."},
  {
    "title": "භවාංග චිත්තය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 8,
    "choices": [
          {"text": "අරමුණු ගන්නා ප්‍රධාන සිත", "isCorrect": false},
          {"text": "සිතේ පදනම් අවස්ථාව", "isCorrect": true},
          {"text": "කර්ම රැස් කරන සිත", "isCorrect": false},
          {"text": "නිවන් දකින සිත", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ භවාංග චිත්තයේ මූලික ස්වභාවය හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. භවාංග චිත්තය යනු සිතේ පදනම් අවස්ථාව හෙවත් මූලික තත්ත්වයයි. එය විශේෂ අරමුණක් නොගන්නා, නමුත් ජීවිතය පවත්වාගෙන යාමට අත්‍යවශ්‍ය වන සිතයි. භවාංග චිත්තය ප්‍රතිසන්ධි චිත්තයෙන් පසු ඇති වන අතර, මරණ චිත්තය දක්වා පවතී. අරමුණු ගැනීම, කර්ම රැස් කිරීම හෝ නිවන් දැකීම වැනි විශේෂිත ක්‍රියා භවාංග චිත්තයේ කාර්යය නොවේ. භවාංග චිත්තය ක්‍රියාත්මක වන්නේ විශේෂ අරමුණක් නොමැති විටදී පමණි, උදාහරණයක් ලෙස ගැඹුරු නින්දේදී."},
  {
    "title": "ජවන චිත්ත යනු මොනවාද?",
    "required": true,
    "points": 1,
    "index": 9,
    "choices": [
          {"text": "නින්දේදී ක්‍රියාත්මක වන සිත්", "isCorrect": false},
          {"text": "අතීත සිදුවීම් මතක් කරන සිත්", "isCorrect": false},
          {"text": "අරමුණු ශක්තිමත්ව ග්‍රහණය කරන සිත්", "isCorrect": true},
          {"text": "අනාගතය ගැන සිතන සිත්", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ ජවන චිත්තවල ප්‍රධාන කාර්යභාරය හොඳින් හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. ජවන චිත්ත යනු අරමුණු ශක්තිමත්ව ග්‍රහණය කරන සිත්ය. මේවා කුසල, අකුසල හෝ ක්‍රියා සිත් විය හැකි අතර, අරමුණු බලවත් ලෙස අත්විඳින්නේ මේ සිත් මගිනි. ජවන චිත්ත කර්ම රැස් කිරීමේ හැකියාව ඇති ප්‍රබල සිත් වේ. සාමාන්‍යයෙන් එක් අරමුණක් සඳහා ජවන චිත්ත සත් වරක් ඇති වේ. මෙම සිත් මගින් තමයි පුද්ගලයා කුසල හෝ අකුසල කර්ම රැස් කරන්නේ. ජවන චිත්ත චිත්ත වීථියේ වැදගත් කොටසක් වන අතර, මේවා මගින් තමයි පුද්ගලයාගේ චේතනාව හා කර්මය තීරණය වන්නේ."},
  {
    "title": "කුශල සිත් හා අකුශල සිත් අතර ප්‍රධාන වෙනස කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 10,
    "choices": [
          {"text": "කුශල සිත් සැපක් ගෙන දෙන අතර අකුශල සිත් දුකක් ගෙන දේ", "isCorrect": false},
          {"text": "කුශල සිත් සතුටු සහගත වන අතර අකුශල සිත් දුක් සහගත වේ", "isCorrect": false},
          {"text": "කුශල සිත් යහපත් විපාක ගෙන දෙන අතර අකුශල සිත් අයහපත් විපාක ගෙන දේ", "isCorrect": true},
          {"text": "කුශල සිත් නිවන් මඟ පාදන අතර අකුශල සිත් සංසාරගත කරයි", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ කුශල හා අකුශල සිත්වල මූලික වෙනස නිවැරදිව අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. කුශල සිත් හා අකුශල සිත් අතර ප්‍රධාන වෙනස වන්නේ ඒවායේ විපාකයන්ය. කුශල සිත් යහපත් විපාක (සුඛ විපාක) ගෙන දෙන අතර අකුශල සිත් අයහපත් විපාක (දුක්ඛ විපාක) ගෙන දේ. මෙය ඒවායේ මූලික ස්වභාවය වන අතර, සැප-දුක, නිවන-සංසාර යනාදිය මෙම මූලික වෙනසේ ප්‍රතිඵල ලෙස සැලකිය හැකිය. කුශල සිත් අලෝභ, අදෝස, අමෝහ මූලයන්ගෙන් හටගන්නා අතර, අකුශල සිත් ලෝභ, ද්වේෂ, මෝහ මූලයන්ගෙන් හටගනී. කුශල සිත් සාමාන්‍යයෙන් නිවන් මඟ පාදන අතර අකුශල සිත් සංසාරගත කරන බව සත්‍ය වුවත්, ඒවායේ මූලික වෙනස වන්නේ ඒවායේ විපාකයන්ය."},
  {
    "title": "චෛතසික යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 11,
    "choices": [
          {"text": "සිත සමඟ එකට උපදින මානසික සාධක", "isCorrect": true},
          {"text": "සිතින් පාලනය කළ නොහැකි හැඟීම්", "isCorrect": false},
          {"text": "සිතේ අතීත මතකයන්", "isCorrect": false},
          {"text": "සිතින් ස්වාධීනව පවතින මානසික ක්‍රියාවලීන්", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ චෛතසිකවල මූලික ස්වභාවය නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. චෛතසික යනු සිත සමඟ එකට උපදින, එකට පවතින හා එකට නිරුද්ධ වන මානසික සාධකයන්ය. මේවා සිතින් වෙන් කළ නොහැකි අතර, සිතේ ගුණාත්මක ස්වභාවය තීරණය කරයි. උදාහරණ ලෙස වේදනා, සඤ්ඤා, චේතනා ආදිය චෛතසික වේ. චෛතසික සිතට පමණක් සීමා නොවී, සිත සමඟ ඒකාබද්ධව ක්‍රියා කරයි. සිතේ ගුණාත්මක ස්වභාවය තීරණය වන්නේ මේ චෛතසික මගිනි. උදාහරණයක් ලෙස, ලෝභ සහගත සිතක් හා අලෝභ සහගත සිතක් අතර වෙනස ඇති කරන්නේ ඒවා සමඟ පවතින චෛතසිකයන්ය. මේ නිසා චෛතසික අවබෝධය බුද්ධ දර්ශනයේ වැදගත් කොටසක් ලෙස සැලකේ."},
  {
    "title": "ඵස්ස චෛතසිකයේ කාර්යභාරය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 12,
    "choices": [
          {"text": "අරමුණු තේරීම", "isCorrect": false},
          {"text": "අරමුණු මතක තබා ගැනීම", "isCorrect": false},
          {"text": "සිත, අරමුණ හා ඉන්ද්‍රිය එකට ගැටීම", "isCorrect": true},
          {"text": "අරමුණු ප්‍රතික්ෂේප කිරීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ ඵස්ස චෛතසිකයේ මූලික කාර්යභාරය හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. ඵස්ස චෛතසිකයේ කාර්යභාරය වන්නේ සිත, අරමුණ හා ඉන්ද්‍රිය එකට ගැටීමයි. මෙය සිතට අරමුණ දැනගැනීමට ඇති මූලික පදනම සපයයි. ඵස්සය නොමැතිව කිසිදු අත්දැකීමක් සිදු විය නොහැක. උදාහරණයක් ලෙස, ඇසට රූපයක් පෙනීමේදී ඇස, රූපය හා චක්ඛු විඤ්ඤාණය එකට ගැටීම ඵස්සයයි. මෙය සියලු අත්දැකීම්වල මූලික අවස්ථාවයි. අරමුණු තේරීම, මතක තබා ගැනීම හෝ ප්‍රතික්ෂේප කිරීම වැනි සංකීර්ණ ක්‍රියා වෙනත් චෛතසිකයන්ගේ කාර්යයන් වේ."},
  {
    "title": "වේදනා චෛතසිකය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 13,
    "choices": [
          {"text": "අරමුණ හඳුනා ගැනීම", "isCorrect": false},
          {"text": "අරමුණ මතක තබා ගැනීම", "isCorrect": false},
          {"text": "අරමුණ සම්බන්ධයෙන් තීරණ ගැනීම", "isCorrect": false},
          {"text": "අරමුණේ රසය විඳීම", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! ඔබ වේදනා චෛතසිකයේ මූලික කාර්යභාරය නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. වේදනා චෛතසිකය යනු අරමුණේ රසය විඳීමයි. මෙය සැප, දුක් හෝ උපේක්ෂා ආකාරයෙන් අත්දැකිය හැකිය. වේදනාව සෑම සිතක්ම සමඟ පවතින අතර, එය අපගේ අත්දැකීම්වල හැඟීම් පැත්ත නියෝජනය කරයි. උදාහරණයක් ලෙස, මිහිරි ආහාරයක් ආහාරයට ගැනීමේදී ඇතිවන සැප වේදනාව හෝ වේදනාවක් දැනෙන විට ඇතිවන දුක් වේදනාව සැලකිය හැක. අරමුණ හඳුනා ගැනීම (සඤ්ඤා), තීරණ ගැනීම (චේතනා) හෝ මතක තබා ගැනීම වෙනත් චෛතසිකයන්ගේ කාර්යයන් වේ."},
  {
    "title": "සඤ්ඤා චෛතසිකයේ ප්‍රධාන කාර්යය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 14,
    "choices": [
          {"text": "අරමුණ හඳුනා ගැනීම හා සලකුණු කර ගැනීම", "isCorrect": true},
          {"text": "අරමුණ සම්බන්ධයෙන් තීරණ ගැනීම", "isCorrect": false},
          {"text": "අරමුණ කෙරෙහි උනන්දුව ඇති කිරීම", "isCorrect": false},
          {"text": "අරමුණේ රසය විඳීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ සඤ්ඤා චෛතසිකයේ මූලික කාර්යභාරය හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. සඤ්ඤා චෛතසිකයේ ප්‍රධාන කාර්යය වන්නේ අරමුණ හඳුනා ගැනීම හා සලකුණු කර ගැනීමයි. මෙය අපගේ අත්දැකීම් හඳුනා ගැනීමට හා මතක තබා ගැනීමට ඉවහල් වන ඉතා වැදගත් චෛතසිකයකි. උදාහරණයක් ලෙස, අපි යමෙකුගේ මුහුණ දුටු විට ඔහු කවුදැයි හඳුනා ගැනීමට උපකාරී වන්නේ සඤ්ඤාවයි. එමෙන්ම, නැවත එම පුද්ගලයා දුටු විට හඳුනා ගැනීමටද සඤ්ඤාව උපකාරී වේ. අරමුණේ රසය විඳීම (වේදනා), තීරණ ගැනීම (චේතනා) හෝ උනන්දුව ඇති කිරීම (ඡන්ද) වෙනත් චෛතසිකයන්ගේ කාර්යයන් වේ."},
  {
    "title": "චේතනා චෛතසිකයේ මූලික කාර්යභාරය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 15,
    "choices": [
          {"text": "සම්ප්‍රයුක්ත ධර්මයන් අරමුණ කෙරෙහි යොමු කිරීම හා ක්‍රියා සම්පාදනය", "isCorrect": true},
          {"text": "අරමුණේ රසය විඳීම", "isCorrect": false},
          {"text": "අරමුණ කෙරෙහි අවධානය පවත්වා ගැනීම", "isCorrect": false},
          {"text": "අරමුණ හඳුනා ගැනීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ චේතනා චෛතසිකයේ මූලික කාර්යභාරය නිවැරදිව අවබෝධ කරගෙන ඇත. චේතනාව සම්ප්‍රයුක්ත ධර්මයන් අරමුණ කෙරෙහි යොමු කරන අතර, ක්‍රියා සම්පාදනය කිරීමෙහිලා ප්‍රධාන කාර්යභාරයක් ඉටු කරයි. මෙය කර්මය සමඟ සෘජුව සම්බන්ධ වන අතර, බුදුන් වහන්සේ විසින් 'චේතනාහං භික්ඛවේ කම්මං වදාමි' (මහණෙනි, චේතනාව කර්මය යැයි මම කියමි) යනුවෙන් දේශනා කර ඇත.",
    "feedbackIncorrect": "වැරදියි. චේතනා චෛතසිකයේ මූලික කාර්යභාරය වන්නේ සම්ප්‍රයුක්ත ධර්මයන් අරමුණ කෙරෙහි යොමු කිරීම හා ක්‍රියා සම්පාදනයයි. චේතනාව යනු අපගේ සියලු ක්‍රියාවන්හි මූලය වන අතර, එය කර්මය සමඟ සෘජුව සම්බන්ධ වේ. උදාහරණයක් ලෙස, යමෙකු දානයක් දීමට සිතන විට, ඒ සඳහා ඇති වන අදහස හා ඒ අනුව ක්‍රියා කිරීමේ චේතනාව මෙම චෛතසිකය මගින් සිදු වේ. අරමුණේ රසය විඳීම (වේදනා), හඳුනා ගැනීම (සඤ්ඤා), හෝ අවධානය පවත්වා ගැනීම (මනසිකාර) වෙනත් චෛතසිකයන්ගේ කාර්යයන් වේ. බුදුන් වහන්සේ විසින් 'චේතනාහං භික්ඛවේ කම්මං වදාමි' (මහණෙනි, චේතනාව කර්මය යැයි මම කියමි) යනුවෙන් දේශනා කර ඇත්තේ චේතනාවේ මෙම වැදගත්කම නිසාය."},
  {
    "title": "ඒකග්ගතා චෛතසිකයේ කාර්යභාරය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 16,
    "choices": [
          {"text": "අරමුණු ප්‍රතික්ෂේප කිරීම", "isCorrect": false},
          {"text": "අරමුණෙහි සිත එක්තැන් කිරීම", "isCorrect": true},
          {"text": "අරමුණු මාරු කිරීම", "isCorrect": false},
          {"text": "අරමුණු විවිධාකාරයෙන් සිතීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ ඒකග්ගතා චෛතසිකයේ මූලික කාර්යභාරය හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. ඒකග්ගතා චෛතසිකයේ කාර්යභාරය වන්නේ අරමුණෙහි සිත එක්තැන් කිරීමයි. මෙය සමාධිය හා සෘජුව සම්බන්ධ වන අතර, සිත එක අරමුණක පිහිටුවා තබා ගැනීමට උපකාරී වේ. උදාහරණයක් ලෙස, භාවනා කරන විට අරමුණෙහි සිත තැන්පත් කර තබා ගැනීමට ඒකග්ගතාව උපකාරී වේ. මෙය සෑම සිතකම පවතින නමුත්, කුසල් සිත්වල එය වඩාත් බලවත් වේ. අරමුණු විවිධාකාරයෙන් සිතීම, මාරු කිරීම හෝ ප්‍රතික්ෂේප කිරීම මෙහි කාර්යය නොවේ. ඒකග්ගතාව දියුණු කිරීමෙන් මානසික ශක්තිය වැඩි දියුණු කර ගත හැකිය."},
  {
    "title": "ජීවිතින්ද්‍රිය චෛතසිකයේ ප්‍රධාන කාර්යය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 17,
    "choices": [
          {"text": "පුනර්භවය සඳහා හේතු වීම", "isCorrect": false},
          {"text": "කර්ම විපාක නිර්මාණය කිරීම", "isCorrect": false},
          {"text": "සම්ප්‍රයුක්ත ධර්මයන් ආරක්ෂා කිරීම හා පවත්වාගෙන යාම", "isCorrect": true},
          {"text": "සිතේ ආයු කාලය තීරණය කිරීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ ජීවිතින්ද්‍රිය චෛතසිකයේ මූලික කාර්යභාරය නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. ජීවිතින්ද්‍රිය චෛතසිකයේ ප්‍රධාන කාර්යය වන්නේ සම්ප්‍රයුක්ත ධර්මයන් (සිත හා අනෙකුත් චෛතසිකයන්) ආරක්ෂා කිරීම හා පවත්වාගෙන යාමයි. මෙය සිත හා චෛතසිකයන්ගේ 'ජීවය' ලෙස සැලකිය හැකිය. උදාහරණයක් ලෙස, ජීවිතින්ද්‍රිය නිසා තමයි එක් චිත්තක්ෂණයක් තුළ සිත හා චෛතසිකයන් පවතින්නේ. එය සිතේ ආයු කාලය තීරණය නොකරන අතර, පුනර්භවය හෝ කර්ම විපාක නිර්මාණය කිරීම ද මෙහි කාර්යය නොවේ. ජීවිතින්ද්‍රිය නාම ධර්ම (සිත හා චෛතසික) හා රූප ධර්ම යන දෙකෙහිම පවතී."},
  {
    "title": "මනසිකාර චෛතසිකයේ මූලික කාර්යභාරය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 18,
    "choices": [
          {"text": "සිත අරමුණ වෙත යොමු කිරීම", "isCorrect": true},
          {"text": "අරමුණ සම්බන්ධයෙන් තීරණ ගැනීම", "isCorrect": false},
          {"text": "අරමුණ හඳුනා ගැනීම", "isCorrect": false},
          {"text": "අරමුණේ රසය විඳීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ මනසිකාර චෛතසිකයේ මූලික කාර්යභාරය හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. මනසිකාර චෛතසිකයේ මූලික කාර්යභාරය වන්නේ සිත අරමුණ වෙත යොමු කිරීමයි. මෙය සිත හා අරමුණ අතර සම්බන්ධය ඇති කරන මූලික චෛතසිකයයි. උදාහරණයක් ලෙස, ඔබ කිසියම් ශබ්දයක් ඇසූ විට ඒ කෙරෙහි අවධානය යොමු කරන්නේ මනසිකාරය නිසාය. මෙය යෝනිසෝ මනසිකාරය (නුවණින් යොමු කිරීම) හෝ අයෝනිසෝ මනසිකාරය (නුවණින් තොරව යොමු කිරීම) ලෙස පැවතිය හැකිය. අරමුණේ රසය විඳීම (වේදනා), හඳුනා ගැනීම (සඤ්ඤා), හෝ තීරණ ගැනීම (චේතනා) වෙනත් චෛතසිකයන්ගේ කාර්යයන් වේ. මනසිකාරය නිසි ලෙස භාවිතා කිරීමෙන් මානසික සංවර්ධනය ඇති කර ගත හැකිය."},
  {
    "title": "විතක්ක චෛතසිකයේ ප්‍රධාන කාර්යය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 19,
    "choices": [
          {"text": "අරමුණ සම්බන්ධයෙන් තීරණ ගැනීම", "isCorrect": false},
          {"text": "අරමුණේ රසය විඳීම", "isCorrect": false},
          {"text": "සිත අරමුණ වෙත ගෙන යාම", "isCorrect": true},
          {"text": "අරමුණ පිළිබඳ ගැඹුරින් සිතීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ විතක්ක චෛතසිකයේ මූලික කාර්යභාරය නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. විතක්ක චෛතසිකයේ ප්‍රධාන කාර්යය වන්නේ සිත අරමුණ වෙත ගෙන යාමයි. එය අරමුණ මත සිත තැබීමේ ආරම්භක අදියර ලෙස සැලකිය හැකිය. උදාහරණයක් ලෙස, ඔබ යම් කාර්යයක් කිරීමට සිතන විට, ඒ පිළිබඳ මූලික අදහස ඇති වන්නේ විතක්කය නිසාය. මෙය ධ්‍යාන සමාධියේදී වැදගත් සාධකයක් වන අතර, පළමු ධ්‍යානයේ අංගයක් ලෙස සැලකේ. අරමුණ පිළිබඳ ගැඹුරින් සිතීම (විචාර), තීරණ ගැනීම (චේතනා), හෝ රසය විඳීම (වේදනා) වෙනත් චෛතසිකයන්ගේ කාර්යයන් වේ. විතක්කය නිසි ලෙස භාවිතා කිරීමෙන් මනස එකඟ කර ගැනීමට හා නිවැරදි දිශාවට යොමු කර ගැනීමට හැකිය."},
  {
    "title": "විචාර චෛතසිකයේ කාර්යභාරය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 20,
    "choices": [
          {"text": "අරමුණ සම්බන්ධයෙන් තීරණ ගැනීම", "isCorrect": false},
          {"text": "අරමුණේ රසය විඳීම", "isCorrect": false},
          {"text": "අරමුණ මත සිත දිගටම පවත්වාගෙන යාම", "isCorrect": true},
          {"text": "අරමුණ වෙත සිත මුලින්ම යොමු කිරීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ විචාර චෛතසිකයේ මූලික කාර්යභාරය හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. විචාර චෛතසිකයේ කාර්යභාරය වන්නේ අරමුණ මත සිත දිගටම පවත්වාගෙන යාමයි. එය විතක්කයෙන් පසු ක්‍රියාත්මක වන අතර, අරමුණ සමඟ සිත දිගටම බැඳී තබා ගනී. උදාහරණයක් ලෙස, ඔබ යම් කරුණක් ගැන සිතන විට, ඒ පිළිබඳව දිගටම සිතමින් සිටීමට විචාරය උපකාරී වේ. මෙය ද ධ්‍යාන සමාධියේ වැදගත් අංගයක් වන අතර, පළමු හා දෙවන ධ්‍යානවල දක්නට ලැබේ. අරමුණ වෙත සිත මුලින්ම යොමු කිරීම (විතක්ක), තීරණ ගැනීම (චේතනා), හෝ රසය විඳීම (වේදනා) වෙනත් චෛතසිකයන්ගේ කාර්යයන් වේ. විචාරය නිසි ලෙස වර්ධනය කිරීමෙන් ගැඹුරු අවබෝධයක් ලබා ගැනීමට හා සමාධිය දියුණු කර ගැනීමට හැකිය."},
  {
    "title": "අධිමොක්ඛ චෛතසිකයේ ප්‍රධාන කාර්යය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 21,
    "choices": [
          {"text": "අරමුණ තීරණය කිරීම හෝ නිශ්චය කිරීම", "isCorrect": true},
          {"text": "අරමුණේ රසය විඳීම", "isCorrect": false},
          {"text": "අරමුණ වෙත සිත යොමු කිරීම", "isCorrect": false},
          {"text": "අරමුණ හඳුනා ගැනීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ අධිමොක්ඛ චෛතසිකයේ මූලික කාර්යභාරය නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. අධිමොක්ඛ චෛතසිකයේ ප්‍රධාන කාර්යය වන්නේ අරමුණ තීරණය කිරීම හෝ නිශ්චය කිරීමයි. මෙය අරමුණ සම්බන්ධයෙන් තීරණාත්මක ස්වභාවයක් ගනී. අධිමොක්ඛය යනු 'තීරණය' හෝ 'අධිෂ්ඨානය' යන අර්ථය දෙන අතර, එය සිතේ ස්ථිරභාවය හා නිශ්චිතභාවය පෙන්නුම් කරයි. උදාහරණයක් ලෙස, යමක් දුටු විට එය කුමක්දැයි නිශ්චය කිරීමේදී අධිමොක්ඛය ක්‍රියාත්මක වේ. අරමුණ වෙත සිත යොමු කිරීම (මනසිකාර), රසය විඳීම (වේදනා), හෝ හඳුනා ගැනීම (සඤ්ඤා) වෙනත් චෛතසිකයන්ගේ කාර්යයන් වේ."},
  {
    "title": "වීරිය චෛතසිකයේ මූලික කාර්යභාරය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 22,
    "choices": [
          {"text": "අරමුණේ රසය විඳීම", "isCorrect": false},
          {"text": "අරමුණ හඳුනා ගැනීම", "isCorrect": false},
          {"text": "මානසික උත්සාහය හා කැපවීම", "isCorrect": true},
          {"text": "අරමුණ වෙත සිත යොමු කිරීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ වීරිය චෛතසිකයේ මූලික කාර්යභාරය හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. වීරිය චෛතසිකයේ මූලික කාර්යභාරය වන්නේ මානසික උත්සාහය හා කැපවීමයි. වීරිය යනු 'වීර්යය' හෝ 'උත්සාහය' යන අර්ථය දෙන අතර, එය කුසල් කිරීමේදී විශේෂයෙන් වැදගත් වේ. මෙය අකුසල් වලින් වැළකී සිටීමට, කුසල් වැඩීමට, හා මානසික සංවර්ධනයට අවශ්‍ය ශක්තිය සපයයි. උදාහරණයක් ලෙස, භාවනා කිරීමේදී මනස එක අරමුණක පිහිටුවා තබා ගැනීමට උත්සාහ දැරීම වීරිය චෛතසිකයේ ක්‍රියාකාරීත්වයයි. අරමුණ වෙත සිත යොමු කිරීම (මනසිකාර), රසය විඳීම (වේදනා), හෝ හඳුනා ගැනීම (සඤ්ඤා) වෙනත් චෛතසිකයන්ගේ කාර්යයන් වේ."},
  {
    "title": "පීති චෛතසිකයේ ප්‍රධාන කාර්යය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 23,
    "choices": [
          {"text": "අරමුණේ රසය විඳීම", "isCorrect": false},
          {"text": "අරමුණ සම්බන්ධයෙන් තීරණ ගැනීම", "isCorrect": false},
          {"text": "අරමුණ හඳුනා ගැනීම", "isCorrect": false},
          {"text": "මානසික ප්‍රීතිය හා සතුට ඇති කිරීම", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! පීති චෛතසිකයේ ප්‍රධාන කාර්යය මානසික ප්‍රීතිය හා සතුට ඇති කිරීම බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. පීති චෛතසිකයේ ප්‍රධාන කාර්යය මානසික ප්‍රීතිය හා සතුට ඇති කිරීමයි. පීතිය යනු අරමුණ කෙරෙහි ඇති වන සතුටු ස්වභාවයයි. එය සෝමනස්සය හා සම්බන්ධ වුවද, වෙනස් චෛතසිකයකි. පීතිය පඤ්ච පීති වශයෙන් පැහැදිලි කෙරේ: ඛුද්දක පීති (සිරුරේ ලොම් කැලඹෙන තරමේ සුළු සතුටක්), ඛණික පීති (විදුලි කොටනවා සේ මොහොතක් පාසා ඇතිවන සතුට), ඔක්කන්තික පීති (මුහුදු රළ සේ ශරීරය පුරා පැතිරෙන සතුට), උබ්බේග පීති (සිරුර හිස්වන තරමට දැනෙන උද්දාමකාරී සතුට), සහ ඵරණ පීති (මුළු සිරුර පුරා පැතිර යන පරිපූර්ණ සතුට). පීතිය භාවනා අභ්‍යාසයන්හිදී වැදගත් වන අතර, ධ්‍යාන සාධක අතර ද පවතී. අරමුණේ රසය විඳීම වේදනා චෛතසිකයේ කාර්යයයි. අරමුණ සම්බන්ධයෙන් තීරණ ගැනීම චේතනා චෛතසිකයට අයත් වේ. අරමුණ හඳුනා ගැනීම සඤ්ඤා චෛතසිකයේ කාර්යයයි."},
  {
    "title": "ඡන්ද චෛතසිකයේ මූලික කාර්යභාරය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 24,
    "choices": [
          {"text": "අරමුණ කෙරෙහි කැමැත්ත හෝ උනන්දුව ඇති කිරීම", "isCorrect": true},
          {"text": "අරමුණේ රසය විඳීම", "isCorrect": false},
          {"text": "අරමුණ සම්බන්ධයෙන් තීරණ ගැනීම", "isCorrect": false},
          {"text": "අරමුණ වෙත සිත යොමු කිරීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ ඡන්ද චෛතසිකයේ මූලික කාර්යභාරය හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. ඡන්ද චෛතසිකයේ මූලික කාර්යභාරය වන්නේ අරමුණ කෙරෙහි කැමැත්ත හෝ උනන්දුව ඇති කිරීමයි. ඡන්දය යනු 'කැමැත්ත' හෝ 'අභිලාෂය' යන අර්ථය දෙන අතර, එය යමක් කිරීමට ඇති මූලික උනන්දුව හෝ උත්සාහය පෙන්නුම් කරයි. මෙය කුසල හෝ අකුසල විය හැකි අතර, ක්‍රියාවක් සිදු කිරීමට අවශ්‍ය මූලික උත්ප්‍රේරණය සපයයි. උදාහරණයක් ලෙස, දානයක් දීමට ඇති කැමැත්ත හෝ භාවනා කිරීමට ඇති උනන්දුව ඡන්ද චෛතසිකය මගින් ඇති කරයි. අරමුණ වෙත සිත යොමු කිරීම (මනසිකාර), රසය විඳීම (වේදනා), හෝ තීරණ ගැනීම (චේතනා) වෙනත් චෛතසිකයන්ගේ කාර්යයන් වේ."},
  {
    "title": "මෝහ චෛතසිකය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 25,
    "choices": [
          {"text": "අරමුණ සම්බන්ධයෙන් උපේක්ෂාව", "isCorrect": false},
          {"text": "අරමුණේ යථා ස්වභාවය නොදැනීම", "isCorrect": true},
          {"text": "අරමුණ කෙරෙහි දැඩි ඇල්ම", "isCorrect": false},
          {"text": "අරමුණ කෙරෙහි ද්වේෂය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ මෝහ චෛතසිකයේ මූලික ස්වභාවය හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. මෝහ චෛතසිකය යනු අරමුණේ යථා ස්වභාවය නොදැනීමයි. මෝහය යනු 'අවිද්‍යාව' හෝ 'නුවණ වැසීම' යන අර්ථය දෙන අතර, එය සියලු අකුසල් වල මූලය වේ. මෝහය නිසා පුද්ගලයා දුක්ඛ සත්‍යය (ජීවිතයේ දුක්ඛදායක ස්වභාවය), සමුදය සත්‍යය (දුකට හේතුව), නිරෝධ සත්‍යය (දුක නිරෝධය), හා මාර්ග සත්‍යය (දුක නිරෝධයට මාර්ගය) නොදනී. මෙය නිවැරදි ඥානය වැළැක්වීමෙන් පුද්ගලයා සංසාර චක්‍රයේ සිරකරයි. අරමුණ කෙරෙහි දැඩි ඇල්ම (ලෝභ), ද්වේෂය, හෝ උපේක්ෂාව වෙනත් චෛතසිකයන්ට අයත් වේ. මෝහය දුරු කිරීම නිවන් මඟ සඳහා ඉතා වැදගත් වේ."},
  {
    "title": "ලෝභ චෛතසිකයේ ප්‍රධාන ලක්ෂණය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 26,
    "choices": [
          {"text": "අරමුණේ යථා ස්වභාවය නොදැනීම", "isCorrect": false},
          {"text": "අරමුණ තදින් ග්‍රහණය කර ගැනීම", "isCorrect": true},
          {"text": "අරමුණ කෙරෙහි උපේක්ෂාව", "isCorrect": false},
          {"text": "අරමුණ ප්‍රතික්ෂේප කිරීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ ලෝභ චෛතසිකයේ මූලික ලක්ෂණය හොඳින් හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. ලෝභ චෛතසිකයේ ප්‍රධාන ලක්ෂණය වන්නේ අරමුණ තදින් ග්‍රහණය කර ගැනීමයි. ලෝභය යනු 'තෘෂ්ණාව' හෝ 'දැඩි ඇල්ම' යන අර්ථය දෙන අතර, එය අරමුණ දැඩිව අල්ලා ගැනීමේ ස්වභාවය පෙන්නුම් කරයි. මෙය කාම වස්තූන්, භවය (පැවැත්ම), හා විභවය (නැති වීම) පිළිබඳ ආශාවන් ලෙස පැහැදිලි කෙරේ. ලෝභය දුකට හේතු වන ප්‍රධාන අකුසල මූලයක් වන අතර, එය නිවන් මඟට බාධාවකි. අරමුණ ප්‍රතික්ෂේප කිරීම (ද්වේෂ), යථා ස්වභාවය නොදැනීම (මෝහ), හෝ උපේක්ෂාව වෙනත් චෛතසිකයන්ට අයත් වේ. ලෝභය දුරු කිරීම සඳහා දාන, සීල, භාවනා වැනි කුසල ක්‍රියා වැදගත් වේ."},
  {
    "title": "ද්වේෂ චෛතසිකයේ මූලික ස්වභාවය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 27,
    "choices": [
          {"text": "අරමුණ තදින් අල්ලා ගැනීම", "isCorrect": false},
          {"text": "අරමුණ කෙරෙහි උපේක්ෂාව", "isCorrect": false},
          {"text": "අරමුණ කෙරෙහි ගැටීම හෝ විරෝධය", "isCorrect": true},
          {"text": "අරමුණේ යථා ස්වභාවය නොදැනීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ ද්වේෂ චෛතසිකයේ මූලික ස්වභාවය නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. ද්වේෂ චෛතසිකයේ මූලික ස්වභාවය වන්නේ අරමුණ කෙරෙහි ගැටීම හෝ විරෝධයයි. ද්වේෂය යනු 'තරහව' හෝ 'අප්‍රිය බව' යන අර්ථය දෙන අතර, එය අරමුණ ප්‍රතික්ෂේප කිරීමේ හෝ එයට විරුද්ධ වීමේ ස්වභාවය පෙන්නුම් කරයි. මෙය ක්‍රෝධය, අප්‍රිය බව, හෝ පළිගැනීමේ හැඟීම ලෙස ද පෙන්විය හැකිය. ද්වේෂය ද දුකට හේතු වන ප්‍රධාන අකුසල මූලයක් වන අතර, එය සාමය හා සහජීවනයට බාධාවකි. අරමුණ තදින් අල්ලා ගැනීම (ලෝභ), යථා ස්වභාවය නොදැනීම (මෝහ), හෝ උපේක්ෂාව වෙනත් චෛතසිකයන්ට අයත් වේ. ද්වේෂය දුරු කිරීම සඳහා මෛත්‍රී භාවනාව හා ක්ෂමාව වැනි භාවිතයන් වැදගත් වේ."},
  {
    "title": "මාන චෛතසිකයේ ප්‍රධාන ලක්ෂණය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 28,
    "choices": [
          {"text": "සිත සමාන කොට සැලකීම", "isCorrect": false},
          {"text": "සිත උපේක්ෂා සහගත කිරීම", "isCorrect": false},
          {"text": "සිත උසස් කොට සැලකීම", "isCorrect": true},
          {"text": "සිත පහත් කොට සැලකීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ මාන චෛතසිකයේ මූලික ලක්ෂණය හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. මාන චෛතසිකයේ ප්‍රධාන ලක්ෂණය වන්නේ සිත උසස් කොට සැලකීමයි. මාන යනු 'අහංකාරය' හෝ 'උඩඟුකම' යන අර්ථය දෙන අතර, එය තමාව අන් අය හා සංසන්දනය කර උසස් කොට සැලකීමේ ස්වභාවය පෙන්නුම් කරයි. මෙය 'මම හොඳයි', 'මම වැදගත්', 'මම ඔවුන්ට වඩා උසස්' යනාදී ආකාරයෙන් පවතී. මාන චෛතසිකය තුන් ආකාරයකින් පවතී: සෙය්‍ය මාන (තමා අනුන්ට වඩා උසස් යැයි සිතීම), සදිස මාන (තමා අනුන් හා සමාන යැයි සිතීම), හා හීන මාන (තමා අනුන්ට වඩා පහත් යැයි සිතීම). මෙය ආර්ය මාර්ගයේ දී ප්‍රහාණය කළ යුතු සංයෝජනයකි. සිත පහත් කොට සැලකීම, සමාන කොට සැලකීම හෝ උපේක්ෂා සහගත කිරීම මාන චෛතසිකයේ මූලික ලක්ෂණ නොවේ."},
  {
    "title": "දිට්ඨි චෛතසිකය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 29,
    "choices": [
          {"text": "අරමුණේ යථා ස්වභාවය දැනීම", "isCorrect": false},
          {"text": "අරමුණ කෙරෙහි උපේක්ෂාව", "isCorrect": false},
          {"text": "වැරදි දැක්ම හෝ මිථ්‍යා දෘෂ්ටිය", "isCorrect": true},
          {"text": "නිවැරදි දැක්ම හෝ සම්මා දිට්ඨිය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ දිට්ඨි චෛතසිකයේ මූලික ස්වභාවය හොඳින් හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. දිට්ඨි චෛතසිකය යනු වැරදි දැක්ම හෝ මිථ්‍යා දෘෂ්ටියයි. දිට්ඨි යනු 'දැක්ම' හෝ 'විශ්වාසය' යන අර්ථය දෙන අතර, මෙහිදී එය වැරදි අවබෝධය හෝ යථාර්ථය වැරදි ලෙස දැකීම හැඳින්වේ. මෙය යථාර්ථය වැරදි ලෙස අර්ථ දැක්වීමට හේතු වන අතර, දුක්ඛයට ප්‍රධාන හේතුවක් වේ. දිට්ඨි චෛතසිකය විවිධ ආකාරයෙන් පවතී, උදාහරණ ලෙස: සස්සත දිට්ඨි (ආත්මය සදාකාලික යැයි විශ්වාස කිරීම), උච්ඡේද දිට්ඨි (මරණින් පසු කිසිවක් නැතැයි විශ්වාස කිරීම), අහේතුක දිට්ඨි (හේතු ඵල නියාමය ප්‍රතික්ෂේප කිරීම) ආදිය. නිවැරදි දැක්ම (සම්මා දිට්ඨි), උපේක්ෂාව, හෝ යථා ස්වභාවය දැනීම දිට්ඨි චෛතසිකයේ ලක්ෂණ නොවේ. දිට්ඨි චෛතසිකය දුරු කිරීම සඳහා ධර්මය නිවැරදිව ශ්‍රවණය කිරීම හා විදර්ශනා භාවනාව වැදගත් වේ."},
  {
    "title": "අලෝභ චෛතසිකයේ ප්‍රධාන ලක්ෂණය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 30,
    "choices": [
          {"text": "අරමුණේ යථා ස්වභාවය නොදැනීම", "isCorrect": false},
          {"text": "අරමුණ අල්ලා නොගැනීම හෝ අත්හැරීම", "isCorrect": true},
          {"text": "අරමුණ කෙරෙහි ගැටීම", "isCorrect": false},
          {"text": "අරමුණ තදින් ග්‍රහණය කර ගැනීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ අලෝභ චෛතසිකයේ මූලික ලක්ෂණය හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. අලෝභ චෛතසිකයේ ප්‍රධාන ලක්ෂණය වන්නේ අරමුණ අල්ලා නොගැනීම හෝ අත්හැරීමයි. අලෝභය යනු 'නොඇලීම' හෝ 'අත්හැරීම' යන අර්ථය දෙන අතර, එය අරමුණ කෙරෙහි ඇලීමෙන් තොරව පවතින ස්වභාවය පෙන්නුම් කරයි. මෙය ත්‍යාගශීලීභාවය, අනාසක්තිය හෝ නිදහස් බව ලෙස ද හැඳින්විය හැකිය. අලෝභය ලෝභයට ප්‍රතිවිරුද්ධ වූ කුසල මූලයකි. එය චාග (පරිත්‍යාග කිරීම), මුත්ති (මුදා හැරීම), අනජ්ඣොසාන (ගිජු නොවීම) යන ලක්ෂණ වලින් යුක්තය."},
  {
    "title": "චිත්ත වර්ගීකරණයේදී, කාමාවචර චිත්ත කීයක් ඇත්තේය?",
    "required": true,
    "points": 1,
    "index": 31,
    "choices": [
          {"text": "89", "isCorrect": false},
          {"text": "121", "isCorrect": false},
          {"text": "54", "isCorrect": true},
          {"text": "15", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! කාමාවචර චිත්ත 54ක් ඇති බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. කාමාවචර චිත්ත 54ක් ඇත. මෙය කාම ලෝකයේ ක්‍රියාත්මක වන සිත් වර්ග වන අතර, කුසල්, අකුසල්, විපාක හා ක්‍රියා චිත්ත ඇතුළත් වේ. මෙම 54 අතර අකුසල චිත්ත 12ක්, කුසල චිත්ත 8ක්, විපාක චිත්ත 23ක් සහ ක්‍රියා චිත්ත 11ක් ඇතුළත් වේ. කාමාවචර චිත්ත මනුෂ්‍ය ලෝකයේ හා කාම දිව්‍ය ලෝකවල ක්‍රියාත්මක වන අතර, එදිනෙදා ජීවිතයේ බොහෝ මානසික ක්‍රියාකාරකම් මේවායින් සිදු වේ."},
  {
    "title": "රූපාවචර චිත්ත කොපමණ ප්‍රමාණයක් ඇත්ද?",
    "required": true,
    "points": 1,
    "index": 32,
    "choices": [
          {"text": "15", "isCorrect": true},
          {"text": "12", "isCorrect": false},
          {"text": "27", "isCorrect": false},
          {"text": "18", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! රූපාවචර චිත්ත 15ක් ඇති බව ඔබ හොඳින් දැන සිටී.",
    "feedbackIncorrect": "වැරදියි. රූපාවචර චිත්ත 15ක් ඇත. මේවා රූප ධ්‍යාන සමඟ සම්බන්ධ සිත් වන අතර, කුසල්, විපාක හා ක්‍රියා චිත්ත ඇතුළත් වේ. මෙම 15 අතර කුසල චිත්ත 5ක්, විපාක චිත්ත 5ක් සහ ක්‍රියා චිත්ත 5ක් ඇතුළත් වේ. රූපාවචර චිත්ත පංච ධ්‍යාන මට්ටම්වලට අනුකූලව වර්ගීකරණය කෙරේ. මේවා ඉහළ මට්ටමේ එකාග්‍රතාවයෙන් යුත් සිත් වන අතර, රූප බ්‍රහ්ම ලෝකවල උපත ලැබීමට හේතු වේ."},
  {
    "title": "අරූපාවචර චිත්ත කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 33,
    "choices": [
          {"text": "12", "isCorrect": true},
          {"text": "16", "isCorrect": false},
          {"text": "8", "isCorrect": false},
          {"text": "15", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! අරූපාවචර චිත්ත 12ක් ඇති බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. අරූපාවචර චිත්ත 12ක් ඇත. මේවා අරූප ධ්‍යාන සමඟ සම්බන්ධ සිත් වන අතර, සෑම අරූප ධ්‍යානයකට ම කුසල්, විපාක හා ක්‍රියා චිත්ත තුන බැගින් ඇතුළත් වේ. මෙම 12 අතර කුසල චිත්ත 4ක්, විපාක චිත්ත 4ක් සහ ක්‍රියා චිත්ත 4ක් ඇතුළත් වේ. අරූපාවචර චිත්ත සතර අරූප ධ්‍යාන මට්ටම්වලට අනුකූලව වර්ගීකරණය කෙරේ: ආකාසානඤ්චායතන, විඤ්ඤාණඤ්චායතන, ආකිඤ්චඤ්ඤායතන, සහ නෙවසඤ්ඤානාසඤ්ඤායතන. මේවා ඉතා සියුම් හා උසස් මට්ටමේ සමාධි අවස්ථා නියෝජනය කරයි."},
  {
    "title": "චතුරාර්ය සත්‍යයන්හි පළමු සත්‍යය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 34,
    "choices": [
          {"text": "සමුදය සත්‍යය", "isCorrect": false},
          {"text": "නිරෝධ සත්‍යය", "isCorrect": false},
          {"text": "දුක්ඛ සත්‍යය", "isCorrect": true},
          {"text": "මග්ග සත්‍යය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! දුක්ඛ සත්‍යය චතුරාර්ය සත්‍යයන්හි පළමු සත්‍යය බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. චතුරාර්ය සත්‍යයන්හි පළමු සත්‍යය දුක්ඛ සත්‍යයි. මෙය ජීවිතයේ අසම්පූර්ණ, අතෘප්තිකර ස්වභාවය පෙන්වා දෙයි. දුක්ඛ සත්‍යය යනු කෙටියෙන් 'දුක' යන්නයි. මෙහිදී දුක යන්නෙන් අදහස් වන්නේ කායික හා මානසික දුක පමණක් නොව, අනිත්‍යතාවය, අසහනකාරී බව, හා අනාත්ම ස්වභාවය ද ය. දුක්ඛ සත්‍යය අවබෝධ කර ගැනීම බුදුදහමේ මූලික පියවරක් වන අතර, එය ජීවිතය පිළිබඳ යථාර්ථවාදී අවබෝධයක් ලබා දෙයි."},
  {
    "title": "චතුරාර්ය සත්‍යයන්හි දෙවන සත්‍යය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 35,
    "choices": [
          {"text": "නිරෝධ සත්‍යය", "isCorrect": false},
          {"text": "සමුදය සත්‍යය", "isCorrect": true},
          {"text": "දුක්ඛ සත්‍යය", "isCorrect": false},
          {"text": "මග්ග සත්‍යය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! සමුදය සත්‍යය චතුරාර්ය සත්‍යයන්හි දෙවන සත්‍යය බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. චතුරාර්ය සත්‍යයන්හි දෙවන සත්‍යය සමුදය සත්‍යයි. මෙය දුකට හේතුව පෙන්වා දෙන අතර, එය තෘෂ්ණාව හෝ දැඩි ආශාව ලෙස හඳුනාගෙන ඇත. සමුදය සත්‍යය තුන් ආකාරයකින් පැහැදිලි කෙරේ: කාම තණ්හා (කාම වස්තූන් කෙරෙහි ඇති ආශාව), භව තණ්හා (පැවැත්ම කෙරෙහි ඇති ආශාව), සහ විභව තණ්හා (නැති වීම කෙරෙහි ඇති ආශාව). මෙම තෘෂ්ණාව නිසා පුද්ගලයා නැවත නැවත සංසාර චක්‍රයේ සැරිසරයි. සමුදය සත්‍යය අවබෝධ කර ගැනීමෙන් දුකේ මූල හේතුව හඳුනාගත හැකි වන අතර, එය නිවන් මඟ සඳහා අත්‍යවශ්‍ය පියවරකි."},
  {
    "title": "පටිච්චසමුප්පාදයේ මුල් සංකල්පය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 36,
    "choices": [
          {"text": "තණ්හාව", "isCorrect": false},
          {"text": "වේදනාව", "isCorrect": false},
          {"text": "අවිද්‍යාව", "isCorrect": true},
          {"text": "ජාති", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! පටිච්චසමුප්පාදයේ මුල් සංකල්පය අවිද්‍යාව බව ඔබ හොඳින් දැන සිටී.",
    "feedbackIncorrect": "වැරදියි. පටිච්චසමුප්පාදයේ මුල් සංකල්පය අවිද්‍යාවයි. අවිද්‍යාව යනු 'නොදැනුවත්කම' හෝ 'මෝහය' යන අර්ථය දෙන අතර, එය චතුරාර්ය සත්‍යය පිළිබඳ නොදැනුවත්කම හෝ වැරදි අවබෝධය හැඳින්වේ. පටිච්චසමුප්පාදය යනු හේතුඵල දාමය හෝ පටිබද්ධ පැවැත්ම යන අර්ථය දෙන අතර, එය සංසාර චක්‍රයේ ක්‍රියාකාරිත්වය පැහැදිලි කරයි. අවිද්‍යාව මුල් වී සංස්කාර, විඤ්ඤාණ, නාමරූප ආදී වශයෙන් අංග 12කින් යුත් මෙම චක්‍රය ක්‍රියාත්මක වේ. අවිද්‍යාව දුරු කිරීමෙන් මෙම චක්‍රය බිඳ දැමිය හැකි අතර, එය නිවන් මඟට අවශ්‍ය ප්‍රඥාව ලබා ගැනීමට උපකාරී වේ."},
  {
    "title": "පටිච්චසමුප්පාදයේ කොපමණ අංග ඇත්තේද?",
    "required": true,
    "points": 1,
    "index": 37,
    "choices": [
          {"text": "12", "isCorrect": true},
          {"text": "14", "isCorrect": false},
          {"text": "10", "isCorrect": false},
          {"text": "8", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! පටිච්චසමුප්පාදයේ අංග 12ක් ඇති බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. පටිච්චසමුප්පාදයේ අංග 12ක් ඇත. මේවා අවිද්‍යාවෙන් ආරම්භ වී ජරා-මරණයෙන් අවසන් වන දුකේ චක්‍රය පෙන්නුම් කරයි. මෙම අංග 12 වන්නේ: 1. අවිජ්ජා (අවිද්‍යාව), 2. සංඛාර (සංස්කාර), 3. විඤ්ඤාණ (විඥානය), 4. නාමරූප (නාම හා රූප), 5. සළායතන (ආයතන හය), 6. ඵස්ස (ස්පර්ශය), 7. වේදනා (වේදනාව), 8. තණ්හා (තෘෂ්ණාව), 9. උපාදාන (උපාදානය), 10. භව (භවය), 11. ජාති (ඉපදීම), 12. ජරාමරණ (ජරා මරණ). මෙම අංග එකිනෙක හා සම්බන්ධ වී සංසාර චක්‍රය පවත්වාගෙන යන ආකාරය පැහැදිලි කරයි."},
  {
    "title": "රූපයේ මූලික ධාතු කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 38,
    "choices": [
          {"text": "6", "isCorrect": false},
          {"text": "4", "isCorrect": true},
          {"text": "5", "isCorrect": false},
          {"text": "3", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! රූපයේ මූලික ධාතු 4ක් ඇති බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. රූපයේ මූලික ධාතු 4ක් ඇත. මේවා පඨවි (පොළොව), ආපෝ (ජලය), තේජෝ (ගින්න), හා වායෝ (වාතය) ලෙස හැඳින්වේ. මේවා මහාභූත රූප ලෙස ද හැඳින්වේ. පඨවි ධාතුව තද ගතිය හෝ ආතතිය නියෝජනය කරයි. ආපෝ ධාතුව බැඳීමේ හෝ ගලා යාමේ ගතිය නියෝජනය කරයි. තේජෝ ධාතුව උණුසුම හෝ සිසිල නියෝජනය කරයි. වායෝ ධාතුව චලනය හෝ පීඩනය නියෝජනය කරයි. මෙම මූලික ධාතු සියලු රූප ධර්මයන්හි පදනම ලෙස සැලකේ."},
  {
    "title": "උපාදාය රූප කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 39,
    "choices": [
          {"text": "18", "isCorrect": false},
          {"text": "16", "isCorrect": false},
          {"text": "24", "isCorrect": true},
          {"text": "28", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! උපාදාය රූප 24ක් ඇති බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. උපාදාය රූප 24ක් ඇත. මේවා මහාභූත රූප මත යැපෙන අතර, ඉන්ද්‍රිය, ගෝචර, හා අන්‍ය රූප ඇතුළත් වේ. උපාදාය රූප වලට ඇතුළත් වන්නේ: පසාද රූප 5 (චක්ඛු, සෝත, ඝාණ, ජිව්හා, කාය), ගෝචර රූප 4 (වර්ණ, ශබ්ද, ගන්ධ, රස), භාව රූප 2 (ඉත්ථි, පුරිස), හදය රූපය, ජීවිත රූපය, ආහාර රූපය, පරිච්ඡේද රූපය, විඤ්ඤත්ති රූප 2 (කාය, වචී), විකාර රූප 3 (ලහුතා, මුදුතා, කම්මඤ්ඤතා), ලක්ඛණ රූප 4 (උපචය, සන්තති, ජරතා, අනිච්චතා). මෙම රූප සියල්ල මහාභූත රූප 4 මත පදනම් වී පවතී."},
  {
    "title": "නිබ්බානයේ ප්‍රධාන ලක්ෂණයක් වන්නේ කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 40,
    "choices": [
          {"text": "දුක්ඛ බව", "isCorrect": false},
          {"text": "අසංඛත බව", "isCorrect": true},
          {"text": "අනිත්‍ය බව", "isCorrect": false},
          {"text": "අනාත්ම බව", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! නිබ්බානයේ ප්‍රධාන ලක්ෂණයක් වන්නේ අසංඛත බව යන්න ඔබ හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. නිබ්බානයේ ප්‍රධාන ලක්ෂණයක් වන්නේ අසංඛත බවයි. අසංඛත යන්නෙන් අදහස් වන්නේ 'සකස් නොකරන ලද' හෝ 'හේතු ප්‍රත්‍යය නිසා හටගත් නොවන' යන්නයි. නිබ්බානය හේතු ප්‍රත්‍යය නිසා හටගත් දෙයක් නොවන අතර, එය අනිත්‍ය, දුක්ඛ, අනාත්ම යන ත්‍රිලක්ෂණයෙන් තොර වේ. නිබ්බානය සදාකාලික, නිත්‍ය, අජර, අමර ස්වභාවයක් ඇති අතර, එය සියලු දුක්වලින් නිදහස් වූ පරම සැනසීමේ තත්ත්වයයි. අනිත්‍ය, දුක්ඛ, අනාත්ම යන ලක්ෂණ සංඛත ධර්මවලට අදාළ වේ."},
  {
    "title": "පංචස්කන්ධය අතුරින් රූප ස්කන්ධයට අයත් නොවන්නේ කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 41,
    "choices": [
          {"text": "වර්ණ රූපය", "isCorrect": false},
          {"text": "පඨවි ධාතුව", "isCorrect": false},
          {"text": "චක්ඛු ප්‍රසාදය", "isCorrect": false},
          {"text": "වේදනා", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! වේදනාව රූප ස්කන්ධයට අයත් නොවන බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. වේදනාව රූප ස්කන්ධයට අයත් නොවේ. වේදනාව යනු වේදනා ස්කන්ධයට අයත් නාම ධර්මයකි. පංචස්කන්ධය යනු රූප, වේදනා, සඤ්ඤා, සංඛාර, හා විඤ්ඤාණ යන ස්කන්ධ පහයි. මෙයින් රූප ස්කන්ධය හැර ඉතිරි සියල්ල නාම ධර්මයෝ වෙති. රූප ස්කන්ධයට අයත් වන්නේ සියලු භෞතික ධර්මයන් වන අතර, චක්ඛු ප්‍රසාදය, වර්ණ රූපය, හා පඨවි ධාතුව ඒවාට උදාහරණ වේ. වේදනාව යනු අරමුණේ රස විඳීමයි, එය මානසික අත්දැකීමක් වන අතර රූප ධර්මයක් නොවේ."},
  {
    "title": "ආයතන අතුරින් බාහිර ආයතනයක් වන්නේ කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 42,
    "choices": [
          {"text": "රූපායතනය", "isCorrect": true},
          {"text": "චක්ඛ්වායතනය", "isCorrect": false},
          {"text": "සෝතායතනය", "isCorrect": false},
          {"text": "මනායතනය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! රූපායතනය බාහිර ආයතනයක් බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. රූපායතනය බාහිර ආයතනයකි. ආයතන 12 දෙකොටසකට බෙදේ: අජ්ඣත්තික (අභ්‍යන්තර) ආයතන 6 සහ බාහිර ආයතන 6. අජ්ඣත්තික ආයතන වන්නේ චක්ඛු, සෝත, ඝාන, ජිව්හා, කාය, හා මන යන ඒවායි. බාහිර ආයතන වන්නේ රූප, සද්ද, ගන්ධ, රස, පොට්ඨබ්බ, හා ධම්ම යන ඒවායි. රූපායතනය යනු ඇසට පෙනෙන රූප වන අතර, එය බාහිර ආයතනයකි. චක්ඛ්වායතනය, සෝතායතනය, හා මනායතනය අභ්‍යන්තර ආයතන වේ. බාහිර ආයතන ඉන්ද්‍රියයන්ට අරමුණු වන අතර, අභ්‍යන්තර ආයතන ඉන්ද්‍රියයන් වේ."},
  {
    "title": "බුද්ධ දේශනාවට අනුව, සත්ත්ව ලෝකය කොපමණ භූමි ප්‍රමාණයකට බෙදා දැක්විය හැකිද?",
    "required": true,
    "points": 1,
    "index": 43,
    "choices": [
          {"text": "25", "isCorrect": false},
          {"text": "36", "isCorrect": false},
          {"text": "42", "isCorrect": false},
          {"text": "31", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! සත්ත්ව ලෝකය භූමි 31කට බෙදා දැක්විය හැකි බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. බුද්ධ දේශනාවට අනුව, සත්ත්ව ලෝකය භූමි 31කට බෙදා දැක්විය හැකිය. මෙය කාම භූමි 11, රූප භූමි 16, හා අරූප භූමි 4 ලෙස වර්ගීකරණය කෙරේ. කාම භූමි 11ට අයත් වන්නේ අපාය භූමි 4 (නිරය, තිරිසන්, පේත, අසුර), මනුෂ්‍ය ලෝකය, හා දිව්‍ය ලෝක 6යි. රූප භූමි 16ට බ්‍රහ්ම ලෝක අයත් වන අතර, අරූප භූමි 4ට උසස්ම බ්‍රහ්ම තල අයත් වේ. මෙම භූමි වර්ගීකරණය සත්ත්වයන්ගේ කර්ම විපාක හා මානසික තත්ත්වයන් අනුව සිදු කර ඇත."},
  {
    "title": "අකුසල කර්ම පථ කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 44,
    "choices": [
          {"text": "8", "isCorrect": false},
          {"text": "10", "isCorrect": true},
          {"text": "12", "isCorrect": false},
          {"text": "14", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! අකුසල කර්ම පථ 10ක් ඇති බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. අකුසල කර්ම පථ 10ක් තිබේ. මේවා කායික කර්ම 3ක්, වාචසික කර්ම 4ක්, හා මානසික කර්ම 3ක් ලෙස බෙදා දැක්විය හැකිය. කායික කර්ම 3 නම්: 1. පාණාතිපාත (සත්ව ඝාතනය), 2. අදින්නාදාන (සොරකම), 3. කාමේසු මිච්ඡාචාර (කාම මිථ්‍යාචාරය). වාචසික කර්ම 4 නම්: 4. මුසාවාද (බොරු කීම), 5. පිසුණාවාචා (කේලාම් කීම), 6. ඵරුසවාචා (පරුෂ වචන කීම), 7. සම්ඵප්පලාප (හිස් වචන කීම). මානසික කර්ම 3 නම්: 8. අභිජ්ඣා (දැඩි ලෝභය), 9. ව්‍යාපාද (හිංසක සිතිවිලි), 10. මිච්ඡාදිට්ඨි (මිථ්‍යා දෘෂ්ටි). මෙම අකුසල කර්ම මඟහැරීම බුද්ධ දේශනාවේ මූලික ඉගැන්වීම් වලින් එකකි."},
  {
    "title": "ප්‍රථම ධ්‍යානයේ ධ්‍යානාංග කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 45,
    "choices": [
          {"text": "3", "isCorrect": false},
          {"text": "5", "isCorrect": true},
          {"text": "6", "isCorrect": false},
          {"text": "4", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ප්‍රථම ධ්‍යානයේ ධ්‍යානාංග 5ක් ඇති බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. ප්‍රථම ධ්‍යානයේ ධ්‍යානාංග 5ක් තිබේ. මේවා විතක්ක, විචාර, පීති, සුඛ, හා ඒකග්ගතා යන ඒවායි. විතක්ක යනු අරමුණ කෙරෙහි සිත යෙදවීමයි. විචාර යනු අරමුණ විමසා බැලීමයි. පීති යනු ප්‍රීතිමත් බවයි. සුඛ යනු මානසික සැපයයි. ඒකග්ගතා යනු සිත එකඟ වීමයි. මෙම ධ්‍යානාංග පංචනීවරණ ධර්මයන් යටපත් කරමින් සමාධිය වර්ධනය කරයි. ද්විතීය ධ්‍යානයේදී විතක්ක විචාර ඉවත් වන අතර, ඉහළ ධ්‍යානයන්හිදී තවත් ධ්‍යානාංග ඉවත් වේ."},
  {
    "title": "බ්‍රහ්ම විහාර කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 46,
    "choices": [
          {"text": "3", "isCorrect": false},
          {"text": "5", "isCorrect": false},
          {"text": "6", "isCorrect": false},
          {"text": "4", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! බ්‍රහ්ම විහාර 4ක් ඇති බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. බ්‍රහ්ම විහාර 4ක් තිබේ. මේවා මෛත්‍රී (සියලු සත්වයන් කෙරෙහි හිතවත් බව), කරුණා (දුක් විඳින සත්වයන් කෙරෙහි අනුකම්පාව), මුදිතා (අන් අයගේ සතුටට සතුටු වීම), හා උපේක්ෂා (සියලු සත්වයන් කෙරෙහි මධ්‍යස්ථ බව) යන ඒවායි. මෙම ගුණාංග වැඩීමෙන් පුද්ගලයා තුළ මානසික සමබරතාවය හා සමාජීය සුහදතාවය වර්ධනය වේ."},
  {
    "title": "විදර්ශනා ඥාන කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 47,
    "choices": [
          {"text": "16", "isCorrect": false},
          {"text": "12", "isCorrect": false},
          {"text": "8", "isCorrect": false},
          {"text": "10", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! විදර්ශනා ඥාන 10ක් ඇති බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. විදර්ශනා ඥාන 10ක් තිබේ. මේවා නාම රූප පරිච්ඡේද ඥානය, පච්චය පරිග්ගහ ඥානය, සම්මසන ඥානය, උදයබ්බය ඥානය, භංග ඥානය, භය ඥානය, ආදීනව ඥානය, නිබ්බිදා ඥානය, මුඤ්චිතුකම්යතා ඥානය, හා පටිසංඛා ඥානය යන ඒවායි. මෙම ඥානයන් වර්ධනය වීමත් සමඟ පුද්ගලයා ක්‍රමයෙන් යථාර්ථය අවබෝධ කර ගනිමින් නිවන් මඟ කරා ළඟා වේ."},
  {
    "title": "විසුද්ධි මාර්ගයේ දැක්වෙන විශුද්ධි කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 48,
    "choices": [
          {"text": "5", "isCorrect": false},
          {"text": "9", "isCorrect": false},
          {"text": "7", "isCorrect": true},
          {"text": "12", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! විසුද්ධි මාර්ගයේ විශුද්ධි 7ක් දැක්වෙන බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. විසුද්ධි මාර්ගයේ විශුද්ධි 7ක් දැක්වේ. මේවා සීල විශුද්ධිය (සිල් පිරිසිදු කිරීම), චිත්ත විශුද්ධිය (සිත පිරිසිදු කිරීම), දිට්ඨි විශුද්ධිය (දැක්ම පිරිසිදු කිරීම), කංඛා විතරණ විශුද්ධිය (සැක දුරු කිරීම), මග්ගාමග්ග ඤාණදස්සන විශුද්ධිය (මාර්ග හා අමාර්ග පිළිබඳ ඥානය), පටිපදා ඤාණදස්සන විශුද්ධිය (පිළිවෙත පිළිබඳ ඥානය), හා ඤාණදස්සන විශුද්ධිය (අවබෝධය පිරිසිදු කිරීම) යන ඒවායි. මෙම විශුද්ධි මාර්ගය ඔස්සේ ගමන් කිරීමෙන් පුද්ගලයා ක්‍රමයෙන් නිවන් අවබෝධය කරා ළඟා වේ."},
  {
    "title": "සමාධි වර්ග කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 49,
    "choices": [
          {"text": "4", "isCorrect": false},
          {"text": "3", "isCorrect": true},
          {"text": "5", "isCorrect": false},
          {"text": "2", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! සමාධි වර්ග 3ක් ඇති බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. සමාධි වර්ග 3ක් තිබේ. මේවා ඛණික සමාධි (ක්ෂණික සමාධිය), උපචාර සමාධි (උපචාර සමාධිය), හා අප්පනා සමාධි (අර්පණා සමාධිය) ලෙස හැඳින්වේ. ඛණික සමාධිය කෙටි කාලීන එකාග්‍රතාවයකි. උපචාර සමාධිය ධ්‍යාන ලැබීමට ආසන්න අවස්ථාවේ ඇතිවන සමාධියයි. අප්පනා සමාධිය ධ්‍යාන අවස්ථාවේ ඇතිවන ගැඹුරු සමාධියයි. මෙම සමාධි වර්ග තුන හරහා භාවනා කරන පුද්ගලයා ක්‍රමයෙන් සිතේ එකඟතාව වර්ධනය කර ගනියි."},
  {
    "title": "චිත්ත වීථියක ජවන් වාර කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 50,
    "choices": [
          {"text": "7", "isCorrect": true},
          {"text": "5", "isCorrect": false},
          {"text": "9", "isCorrect": false},
          {"text": "12", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! චිත්ත වීථියක ජවන් වාර 7ක් ඇති බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. සාමාන්‍ය චිත්ත වීථියක ජවන් වාර 7ක් තිබේ. ජවන් යනු අරමුණ මුලින්ම අත්විඳින චිත්ත ක්ෂණයන්ය. මෙය අරමුණේ බලවත් භාවය අනුව වෙනස් විය හැකි නමුත්, සාමාන්‍යයෙන් 7ක් ලෙස සැලකේ. මෙම ජවන් වාර 7 තුළදී කර්ම රැස් වේ. මේ නිසා ජවන් චිත්ත ඉතා වැදගත් වන අතර, එය අපගේ කර්ම විපාක තීරණය කිරීමේදී ප්‍රධාන කාර්යභාරයක් ඉටු කරයි."},
  {
    "title": "නාම ධර්ම සහ රූප ධර්ම අතර ප්‍රධාන වෙනස කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 51,
    "choices": [
          {"text": "නාම ධර්ම සදා පවතී, රූප ධර්ම අනිත්‍යය", "isCorrect": false},
          {"text": "නාම ධර්ම අරමුණු දැන ගනී, රූප ධර්ම අරමුණු නොදනී", "isCorrect": true},
          {"text": "නාම ධර්ම කර්මජ පමණි, රූප ධර්ම චිත්තජ පමණි", "isCorrect": false},
          {"text": "නාම ධර්ම රූපී වන අතර රූප ධර්ම අරූපී වේ", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! නාම ධර්ම හා රූප ධර්ම අතර ප්‍රධාන වෙනස ඔබ හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. නාම ධර්ම හා රූප ධර්ම අතර ප්‍රධාන වෙනස නම් නාම ධර්ම අරමුණු දැන ගන්නා අතර රූප ධර්ම අරමුණු නොදන්නා බවයි. නාම ධර්ම යනු සිත හා සිතේ පවතින චෛතසික ධර්මයන් වන අතර, ඒවා අරූපී වේ. රූප ධර්ම යනු භෞතික ස්වභාවයෙන් යුත් ධර්මයන් වේ. නාම ධර්ම හා රූප ධර්ම යන දෙකම අනිත්‍යය වේ. කර්මජ, චිත්තජ, උතුජ හා ආහාරජ යන සතර සමුට්ඨාන දෙකටම අදාළ විය හැකිය. මෙම වෙනස්කම් තේරුම් ගැනීම අභිධර්මය අධ්‍යයනයේදී වැදගත් වේ."},
  {
    "title": "පටිච්චසමුප්පාදයේ 'භව' යන්නෙන් අදහස් වන්නේ කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 52,
    "choices": [
          {"text": "කාම භව, රූප භව සහ අරූප භව", "isCorrect": false},
          {"text": "මනුෂ්‍ය භව සහ දිව්‍ය භව", "isCorrect": false},
          {"text": "අතීත භව සහ අනාගත භව", "isCorrect": false},
          {"text": "කර්ම භව සහ උපපත්ති භව", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! 'භව' යන්නෙන් අදහස් වන්නේ කර්ම භව සහ උපපත්ති භව බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. පටිච්චසමුප්පාදයේ 'භව' යන්නෙන් අදහස් වන්නේ කර්ම භව සහ උපපත්ති භවයි. කර්ම භව යනු පුනර්භවය ඇති කරන කර්මයන් වන අතර, උපපත්ති භව යනු ඒ කර්මයන්ගේ විපාක වශයෙන් ලැබෙන උපත හෝ භවයයි. මෙය සංසාර චක්‍රයේ ඉතා වැදගත් අංගයකි. කර්ම භව නිසා උපපත්ති භව සිදුවන අතර, එය නැවත නැවත උපත් ලැබීමට හේතු වේ. මෙම සංකල්පය තේරුම් ගැනීම දුකින් මිදීමේ මාර්ගය අවබෝධ කර ගැනීමට උපකාරී වේ. බුදු දහමේ ඉගැන්වෙන පරිදි, මෙම භව චක්‍රය නැවැත්වීමෙන් දුකින් නිදහස් විය හැකිය."},
  {
    "title": "කිලෙස් වර්ග කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 53,
    "choices": [
          {"text": "12", "isCorrect": false},
          {"text": "8", "isCorrect": false},
          {"text": "14", "isCorrect": false},
          {"text": "10", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! කිලෙස් වර්ග 10ක් ඇති බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. කිලෙස් වර්ග 10ක් තිබේ. මේවා ලෝභ (තෘෂ්ණාව), දෝස (ද්වේෂය), මෝහ (අවිද්‍යාව), මාන (අහංකාරය), දිට්ඨි (මිථ්‍යා දෘෂ්ටි), විචිකිච්ඡා (සැකය), ථීන (අකර්මණ්‍යතාවය), උද්ධච්ච (සිත් විසිරීම), අහිරික (පව් කිරීමට නොලැජ්ජා වීම), සහ අනොත්තප්ප (පව් කිරීමට බිය නොවීම) යන ඒවායි. මේ කිලෙස් ධර්ම සත්ත්වයන් සංසාරයේ බැඳ තබන බැවින් ඒවා හඳුනාගෙන ඉවත් කිරීම නිවන් මඟ සඳහා අත්‍යවශ්‍ය වේ."},
  {
    "title": "අභිධර්මයේ සඳහන් වන පරිදි, රූප කලාපයක අවම වශයෙන් රූප ධර්ම කීයක් අඩංගු වේද?",
    "required": true,
    "points": 1,
    "index": 54,
    "choices": [
          {"text": "8", "isCorrect": true},
          {"text": "12", "isCorrect": false},
          {"text": "4", "isCorrect": false},
          {"text": "16", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! රූප කලාපයක අවම වශයෙන් රූප ධර්ම 8ක් අඩංගු වන බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. අභිධර්මයට අනුව, රූප කලාපයක අවම වශයෙන් රූප ධර්ම 8ක් අඩංගු වේ. මේවා මහා භූත රූප 4 (පඨවි - පෘථිවි ධාතුව, ආපෝ - ජල ධාතුව, තේජෝ - ගිනි ධාතුව, වායෝ - වායු ධාතුව) සහ උපාදාය රූප 4 (වර්ණ, ගන්ධ, රස, ඕජා) වේ. මෙම රූප ධර්ම 8 සෑම රූප කලාපයකම අනිවාර්යයෙන් පවතින අතර, ඒවා අවිනිභොග රූප ලෙස හැඳින්වේ. රූප ධර්මයන් පිළිබඳ මෙම සියුම් අවබෝධය විදර්ශනා භාවනාවේදී වැදගත් වේ."},
  {
    "title": "ලෝකෝත්තර මාර්ග චිත්ත කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 55,
    "choices": [
          {"text": "16", "isCorrect": false},
          {"text": "4", "isCorrect": true},
          {"text": "20", "isCorrect": false},
          {"text": "8", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ලෝකෝත්තර මාර්ග චිත්ත 4ක් ඇති බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. ලෝකෝත්තර මාර්ග චිත්ත 4ක් තිබේ. මේවා සෝවාන් මග්ග (සෝවාන් මාර්ග චිත්තය), සකදාගාමී මග්ග (සකදාගාමී මාර්ග චිත්තය), අනාගාමී මග්ග (අනාගාමී මාර්ග චිත්තය), සහ අරහත් මග්ග (අරහත් මාර්ග චිත්තය) චිත්ත වේ. මෙම චිත්ත නිර්වාණය අරමුණු කරගෙන පහළ වන අතර, එක් එක් මාර්ග චිත්තය නිශ්චිත කිලෙස් ප්‍රමාණයක් සම්පූර්ණයෙන්ම නැති කරයි. මෙම මාර්ග චිත්ත අවබෝධ කර ගැනීම බුදු දහමේ නිවන් මඟ පිළිබඳ ගැඹුරු අවබෝධයක් ලබා ගැනීමට උපකාරී වේ."},
  {
    "title": "නිර්වාණය අවබෝධ කර ගැනීමට අවශ්‍ය ප්‍රඥාව කුමන නමින් හැඳින්වේද?",
    "required": true,
    "points": 1,
    "index": 56,
    "choices": [
          {"text": "චින්තාමය ප්‍රඥාව", "isCorrect": false},
          {"text": "විපස්සනා ප්‍රඥාව", "isCorrect": true},
          {"text": "සුතමය ප්‍රඥාව", "isCorrect": false},
          {"text": "සම්මුති ප්‍රඥාව", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! නිර්වාණය අවබෝධ කර ගැනීමට අවශ්‍ය ප්‍රඥාව විපස්සනා ප්‍රඥාව බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. නිර්වාණය අවබෝධ කර ගැනීමට අවශ්‍ය ප්‍රඥාව විපස්සනා ප්‍රඥාව ලෙස හැඳින්වේ. විපස්සනා ප්‍රඥාව යනු සියලු සංස්කාර ධර්මයන්හි ත්‍රිලක්ෂණය (අනිත්‍ය, දුක්ඛ, අනාත්ම) පිළිබඳ ගැඹුරු අවබෝධය ඇති කරන ප්‍රඥාවයි. මෙය භාවනාව තුළින් වර්ධනය කරගත යුතු අතර, එමඟින් යථාර්ථය පිළිබඳ නිවැරදි අවබෝධය ලැබී නිවන් මඟ පාදා ගත හැකිය. සම්මුති ප්‍රඥාව, සුතමය ප්‍රඥාව, හා චින්තාමය ප්‍රඥාව යනු ලෞකික ප්‍රඥාවන් වන අතර, ඒවා නිර්වාණය අවබෝධ කර ගැනීමට ප්‍රමාණවත් නොවේ."},
  {
    "title": "අභිධර්මයේ සඳහන් වන චිත්ත වීථි ප්‍රධාන කොටස් කීයකට බෙදිය හැකිද?",
    "required": true,
    "points": 1,
    "index": 57,
    "choices": [
          {"text": "4", "isCorrect": false},
          {"text": "10", "isCorrect": false},
          {"text": "8", "isCorrect": false},
          {"text": "6", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! චිත්ත වීථි ප්‍රධාන කොටස් 6කට බෙදිය හැකි බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. අභිධර්මයේ සඳහන් වන චිත්ත වීථි ප්‍රධාන කොටස් 6කට බෙදිය හැකිය. මේවා අතීත භවාංග (පෙර භවාංගය), භවාංග චලන (භවාංග චලනය), භවාංගුපච්ඡේද (භවාංග නිරෝධය), ආවජ්ජන (ආවර්ජනය), ජවන (ජවන), සහ තදාරම්මණ (තදාලම්බන) වේ. මෙම කොටස් එකිනෙක පිළිවෙලින් සිදුවන අතර, එමඟින් අරමුණක් ග්‍රහණය කර ගැනීමේ සම්පූර්ණ ක්‍රියාවලිය විස්තර කෙරේ. මෙම චිත්ත වීථි ක්‍රියාවලිය තේරුම් ගැනීම මනසේ ක්‍රියාකාරීත්වය පිළිබඳ ගැඹුරු අවබෝධයක් ලබා ගැනීමට උපකාරී වේ."},
  {
    "title": "භවාංග චිත්තය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 58,
    "choices": [
          {"text": "නිවන් දකින සිත", "isCorrect": false},
          {"text": "කර්ම රැස් කරන සිත", "isCorrect": false},
          {"text": "අරමුණු දැන ගන්නා සිත", "isCorrect": false},
          {"text": "ජීවිතය පවත්වාගෙන යන මූලික සිත", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! භවාංග චිත්තය යනු ජීවිතය පවත්වාගෙන යන මූලික සිත බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. භවාංග චිත්තය යනු ජීවිතය පවත්වාගෙන යන මූලික සිතයි. මෙය ප්‍රතිසන්ධි චිත්තයෙන් පසු ඇතිවන, විශේෂ අරමුණක් නොගන්නා නමුත් ජීවිතය පවත්වාගෙන යාමට අත්‍යවශ්‍ය වන සිතයි. භවාංග චිත්තය නිරන්තරයෙන් පවතින අතර, බාහිර අරමුණක් පැමිණි විට එය නතර වී චිත්ත වීථියක් ආරම්භ වේ. මෙම සංකල්පය තේරුම් ගැනීම මනසේ මූලික ක්‍රියාකාරීත්වය අවබෝධ කර ගැනීමට වැදගත් වේ."},
  {
    "title": "අභිධර්මයට අනුව, සෝවාන් පුද්ගලයා විසින් ප්‍රහාණය කරන සංයෝජන කීයක්ද?",
    "required": true,
    "points": 1,
    "index": 59,
    "choices": [
          {"text": "7", "isCorrect": false},
          {"text": "10", "isCorrect": false},
          {"text": "3", "isCorrect": true},
          {"text": "5", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! සෝවාන් පුද්ගලයා විසින් සංයෝජන 3ක් ප්‍රහාණය කරන බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. අභිධර්මයට අනුව, සෝවාන් පුද්ගලයා විසින් සංයෝජන 3ක් ප්‍රහාණය කරයි. මේවා සක්කාය දිට්ඨි (ආත්ම සංඥාව), විචිකිච්ඡා (සැකය), සහ සීලබ්බත පරාමාස (සීලව්‍රත උපාදානය) යන ඒවායි. සෝවාන් මාර්ගය ප්‍රතිලාභ කිරීමෙන් මෙම සංයෝජන තුන සම්පූර්ණයෙන්ම ප්‍රහාණය වන අතර, එමඟින් පුද්ගලයා සංසාර චක්‍රයේ පහළම තලයන්ට වැටීමෙන් වළක්වාලයි. මෙම දැනුම නිවන් මඟ පිළිබඳ ගැඹුරු අවබෝධයක් ලබා ගැනීමට උපකාරී වේ."},
  {
    "title": "නාම ධර්මයන් කෙතරම් වේගයෙන් ඇති වී නැති වේද?",
    "required": true,
    "points": 1,
    "index": 60,
    "choices": [
          {"text": "මිනිත්තුවකට සියයක්", "isCorrect": false},
          {"text": "තත්පරයකට එකක්", "isCorrect": false},
          {"text": "එක් ක්ෂණයකදී බිලියන ගණනක්", "isCorrect": true},
          {"text": "දිනකට දහසක්", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! නාම ධර්මයන් එක් ක්ෂණයකදී බිලියන ගණනක් ඇති වී නැති වන බව ඔබ හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. අභිධර්මයට අනුව, නාම ධර්මයන් එක් ක්ෂණයකදී බිලියන ගණනක් ඇති වී නැති වේ. මෙය ඉතා සියුම් හා වේගවත් ක්‍රියාවලියක් වන අතර, සාමාන්‍ය මානව අවබෝධයට ඔබ්බෙන් පවතී. මෙම සංකල්පය අනිත්‍යතාවය පිළිබඳ බුදු දහමේ ඉගැන්වීම් සමඟ සම්බන්ධ වන අතර, එය සියලු සංස්කාර ධර්මයන්ගේ ක්ෂණික ස්වභාවය පෙන්නුම් කරයි. මෙම දැනුම විදර්ශනා භාවනාවේදී වැදගත් වන අතර, එමඟින් අනිත්‍යතාවය පිළිබඳ ගැඹුරු අවබෝධයක් ලබා ගත හැකිය."},
  {
    "title": "පංච නීවරණ අතරින් එකක් නොවන්නේ කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 61,
    "choices": [
          {"text": "විචිකිච්ඡාව", "isCorrect": false},
          {"text": "මානය", "isCorrect": true},
          {"text": "කාමච්ඡන්දය", "isCorrect": false},
          {"text": "ව්‍යාපාදය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! මානය පංච නීවරණ අතරට නොගැනෙන බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. මානය පංච නීවරණ අතරට නොගැනේ. පංච නීවරණ වන්නේ කාමච්ඡන්දය (කාම අභිලාෂය), ව්‍යාපාදය (ද්වේෂය), ථීනමිද්ධය (ථීන මිද්ධය - අලසකම හා නිදිමත), උද්ධච්චකුක්කුච්චය (උද්ධච්ච කුක්කුච්ච - සිත් විසිරීම හා පසුතැවීම), සහ විචිකිච්ඡාව (සැකය) යන ඒවායි. මානය කෙලෙස් ධර්මයක් වුවද, එය නීවරණයක් ලෙස නොසැලකේ. නීවරණ ධර්ම සමාධියට බාධා කරන අතර, ඒවා හඳුනාගෙන මඟහරවා ගැනීම භාවනා පුහුණුවේ වැදගත් අංගයකි."},
  {
    "title": "අභිධර්මයේ සඳහන් වන පරිදි, කාම ලෝකයේ ඇති භූමි සංඛ්‍යාව කීයද?",
    "required": true,
    "points": 1,
    "index": 62,
    "choices": [
          {"text": "31", "isCorrect": false},
          {"text": "20", "isCorrect": false},
          {"text": "11", "isCorrect": true},
          {"text": "16", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! කාම ලෝකයේ භූමි 11ක් ඇති බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. අභිධර්මයට අනුව, කාම ලෝකයේ භූමි 11ක් ඇත. මේවාට අපාය භූමි 4 (නිරය, තිරිසන් යෝනිය, පේත ලෝකය, අසුර කාය), මනුෂ්‍ය භූමිය, සහ කාමාවචර දිව්‍ය ලෝක 6 (චාතුම්මහාරාජික, තාවතිංස, යාම, තුසිත, නිම්මානරති, පරනිම්මිත වසවත්ති) ඇතුළත් වේ. මෙම භූමි වර්ගීකරණය කර්මානුරූපව සත්ත්වයන් උපත ලබන විවිධ තල පෙන්නුම් කරයි. මෙම දැනුම සංසාර චක්‍රය පිළිබඳ ගැඹුරු අවබෝධයක් ලබා ගැනීමට උපකාරී වේ."},
  {
    "title": "කාමාවචර ශෝභන චිත්ත කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 63,
    "choices": [
          {"text": "18", "isCorrect": false},
          {"text": "12", "isCorrect": false},
          {"text": "24", "isCorrect": true},
          {"text": "30", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! කාමාවචර ශෝභන චිත්ත 24ක් ඇති බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. කාමාවචර ශෝභන චිත්ත 24ක් තිබේ. මේවා මහාකුසල චිත්ත 8, මහාවිපාක චිත්ත 8, සහ මහාක්‍රියා චිත්ත 8 ලෙස බෙදිය හැකිය. මහාකුසල චිත්ත කුසල් සිදු කිරීමේදී පහළ වන අතර, මහාවිපාක චිත්ත එම කුසල් කර්මවල විපාක ලෙස පහළ වේ. මහාක්‍රියා චිත්ත රහතන් වහන්සේලාගේ ක්‍රියා සිත් වේ. මෙම චිත්ත වර්ගීකරණය තේරුම් ගැනීම කර්ම සහ විපාක පිළිබඳ ගැඹුරු අවබෝධයක් ලබා ගැනීමට උපකාරී වේ."},
  {
    "title": "සතර අපාය අතරින් එකක් නොවන්නේ කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 64,
    "choices": [
          {"text": "මනුෂ්‍ය ලෝකය", "isCorrect": true},
          {"text": "තිරිසන් යෝනිය", "isCorrect": false},
          {"text": "පේත ලෝකය", "isCorrect": false},
          {"text": "නිරය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! මනුෂ්‍ය ලෝකය සතර අපාය අතරට නොගැනෙන බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. මනුෂ්‍ය ලෝකය සතර අපාය අතරට නොගැනේ. සතර අපාය වන්නේ නිරය, තිරිසන් යෝනිය, පේත ලෝකය, සහ අසුර කාය යන ඒවායි. මනුෂ්‍ය ලෝකය සුගති භූමියක් ලෙස සැලකෙන අතර, එය නිවන් අවබෝධය සඳහා ඉතා සුදුසු තැනක් ලෙස බුදු දහමේ විස්තර කෙරේ. අපාය භූමි දුක් සහගත උපත් ස්ථාන ලෙස සැලකෙන අතර, ඒවායේ උපත ලැබීම අකුසල කර්මවල ප්‍රතිඵලයක් ලෙස දැක්වේ."},
  {
    "title": "සෝභන චෛතසික කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 65,
    "choices": [
          {"text": "52", "isCorrect": false},
          {"text": "30", "isCorrect": false},
          {"text": "19", "isCorrect": false},
          {"text": "25", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! සෝභන චෛතසික 25ක් ඇති බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. සෝභන චෛතසික 25ක් තිබේ. මේවා සෝභන සාධාරණ චෛතසික 19, විරති චෛතසික 3 (සම්මා වාචා, සම්මා කම්මන්ත, සම්මා ආජීව), අප්පමඤ්ඤා චෛතසික 2 (කරුණා, මුදිතා), සහ පඤ්ඤින්ද්‍රිය චෛතසිකය යන ඒවා වේ. සෝභන චෛතසික යනු කුසල් සිත්වල පවතින යහපත් මානසික සාධක වේ. මේවා පුද්ගලයාගේ මානසික තත්ත්වය උසස් කරන අතර, නිවන් මඟ සඳහා ඉතා වැදගත් වේ."},
  {
    "title": "චිත්තක්ෂණයක කොටස් කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 66,
    "choices": [
          {"text": "5", "isCorrect": false},
          {"text": "2", "isCorrect": false},
          {"text": "4", "isCorrect": false},
          {"text": "3", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! චිත්තක්ෂණයක කොටස් 3ක් ඇති බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. චිත්තක්ෂණයක කොටස් 3ක් තිබේ. මේවා උප්පාද (ඇතිවීම), ඨිති (පැවතීම), සහ භංග (නැතිවීම) යන ඒවායි. මෙම කොටස් තුන සෑම චිත්තයකම ඉතා කෙටි කාලයක් තුළ සිදුවේ. මෙම සංකල්පය තේරුම් ගැනීම අනිත්‍යතාවය පිළිබඳ ගැඹුරු අවබෝධයක් ලබා ගැනීමට උපකාරී වන අතර, එය විදර්ශනා භාවනාවේ වැදගත් අංගයකි."},
  {
    "title": "අභිධර්මයේ සඳහන් වන පරිදි, නාම ධර්ම හා රූප ධර්ම අතරින් වඩාත් කෙටි කාලයක් පවතින්නේ කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 67,
    "choices": [
          {"text": "රූප ධර්ම", "isCorrect": false},
          {"text": "නාම ධර්ම", "isCorrect": true},
          {"text": "දෙකම සදාකාලිකව පවතී", "isCorrect": false},
          {"text": "දෙකම සමාන කාලයක් පවතී", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! නාම ධර්ම වඩාත් කෙටි කාලයක් පවතින බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. අභිධර්මයට අනුව, නාම ධර්ම වඩාත් කෙටි කාලයක් පවතී. රූප ධර්මයක ආයුෂ කාලය නාම ධර්මයක ආයුෂ කාලයට වඩා 17 ගුණයක් දිගු වේ. මෙම වෙනස තේරුම් ගැනීම නාම රූප ධර්මයන්ගේ ස්වභාවය පිළිබඳ ගැඹුරු අවබෝධයක් ලබා ගැනීමට උපකාරී වන අතර, එය විදර්ශනා භාවනාවේදී වැදගත් වේ."},
  {
    "title": "නිර්වාණය සම්බන්ධයෙන් වඩාත් නිවැරදි ප්‍රකාශය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 68,
    "choices": [
          {"text": "එය නාම ධර්මයකි", "isCorrect": false},
          {"text": "එය රූප ධර්මයකි", "isCorrect": false},
          {"text": "එය අසංඛත ධර්මයකි", "isCorrect": true},
          {"text": "එය සංඛත ධර්මයකි", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! නිර්වාණය අසංඛත ධර්මයක් බව ඔබ හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. නිර්වාණය අසංඛත ධර්මයකි. එය හේතු ප්‍රත්‍යය නිසා හටගත් දෙයක් නොවන අතර, නාම හෝ රූප ධර්මයන්ට අයත් නොවේ. නිර්වාණය යනු සියලු දුක්වලින් නිදහස් වූ, සදාකාලික සැනසීමේ තත්ත්වයයි. එය බුදු දහමේ අවසාන ඉලක්කය වන අතර, සියලු සංසාරික බැඳීම්වලින් නිදහස් වීම ලෙස හැඳින්වේ."},
  {
    "title": "ත්‍රිලක්ෂණය පිළිබඳව වඩාත් නිවැරදි ප්‍රකාශය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 69,
    "choices": [
          {"text": "නිත්‍ය, සුඛ, ආත්ම යන ලක්ෂණ තුන නිර්වාණයට පමණක් අදාළ වේ", "isCorrect": false},
          {"text": "අනිත්‍ය, දුක්ඛ, අනාත්ම යන ලක්ෂණ තුන සියලු සංස්කාර ධර්මයන්ට පොදු වේ", "isCorrect": true},
          {"text": "අනිත්‍ය, දුක්ඛ, අනාත්ම යන ලක්ෂණ තුන නිර්වාණයට පමණක් අදාළ වේ", "isCorrect": false},
          {"text": "නිත්‍ය, සුඛ, ආත්ම යන ලක්ෂණ තුන සියලු සංස්කාර ධර්මයන්ට පොදු වේ", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ ත්‍රිලක්ෂණය පිළිබඳව නිවැරදි අවබෝධයක් ලබා ඇත. අනිත්‍ය (අස්ථිර බව), දුක්ඛ (අතෘප්තිකර බව), අනාත්ම (ස්වයං-සාරයක් නැති බව) යන ලක්ෂණ තුන සියලු සංස්කාර ධර්මයන්ට පොදු වේ. මෙය බුදු දහමේ මූලික ඉගැන්වීමක් වන අතර, විදර්ශනා භාවනාවේ ප්‍රධාන අරමුණකි.",
    "feedbackIncorrect": "වැරදියි. ත්‍රිලක්ෂණය යනු අනිත්‍ය, දුක්ඛ, අනාත්ම යන ලක්ෂණ තුනයි. මෙය සියලු සංස්කාර ධර්මයන්ට පොදු වේ, නිර්වාණයට පමණක් නොවේ. නිත්‍ය, සුඛ, ආත්ම යන ඒවා මිථ්‍යා දෘෂ්ටි වන අතර, බුදු දහමේ ප්‍රතික්ෂේප කෙරේ. ත්‍රිලක්ෂණය අවබෝධ කර ගැනීම දුකින් නිදහස් වීමට අත්‍යවශ්‍ය වේ. මෙම අවබෝධය විදර්ශනා භාවනාව තුළින් වර්ධනය කර ගත හැකි අතර, එය නිවන් මඟ සඳහා ඉතා වැදගත් වේ."},
  {
    "title": "ආයතන කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 70,
    "choices": [
          {"text": "24", "isCorrect": false},
          {"text": "18", "isCorrect": false},
          {"text": "6", "isCorrect": false},
          {"text": "12", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! ආයතන 12ක් ඇති බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. ආයතන 12ක් තිබේ. මේවා අභ්‍යන්තර ආයතන 6ක් (චක්ඛු, සෝත, ඝාන, ජිව්හා, කාය, මනෝ) සහ බාහිර ආයතන 6ක් (රූප, සද්ද, ගන්ධ, රස, ඵොට්ඨබ්බ, ධම්ම) ලෙස බෙදිය හැකිය. මෙම ආයතන 12 අපගේ අත්දැකීම් සියල්ල ආවරණය කරයි - අපගේ පංචෙන්ද්‍රිය හා මනස (අභ්‍යන්තර), සහ ඒවාට අදාළ අරමුණු (බාහිර). මෙය බුදුදහමේ ඉගැන්වෙන පරිදි සත්ත්වයාගේ සම්පූර්ණ අත්දැකීම් පරාසය නියෝජනය කරයි."},
  {
    "title": "මනායතනය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 71,
    "choices": [
          {"text": "හදවත", "isCorrect": false},
          {"text": "සිත", "isCorrect": true},
          {"text": "මොළය", "isCorrect": false},
          {"text": "නාසය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! මනායතනය යනු සිත බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. මනායතනය යනු සිතයි. මෙය භෞතික මොළය හෝ හදවත නොවන අතර, අභිධර්මයේ සඳහන් වන පරිදි සිත යනු රූපී නොවන නාම ධර්මයකි. මනායතනය යනු අපගේ මානසික ක්‍රියාවලීන් සියල්ල සිදුවන තැනයි. එය චින්තනය, මතකය, හැඟීම්, තීරණ ගැනීම වැනි සියලු මානසික ක්‍රියාකාරකම් සිදුවන ස්ථානයයි. බුදුදහමේ ඉගැන්වෙන පරිදි, මනායතනය අනෙක් ඉන්ද්‍රියයන්ගෙන් ලැබෙන තොරතුරු සැකසීමට සහ ධම්මායතනයෙන් ලැබෙන අරමුණු (අතීත මතක, අනාගත සිතුවිලි, සංකල්ප ආදිය) ග්‍රහණය කර ගැනීමට හැකියාව ඇති විශේෂ ආයතනයකි."},
  {
    "title": "මෛත්‍රී භාවනාවේ ප්‍රධාන අරමුණ කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 72,
    "choices": [
          {"text": "සියලු සත්ත්වයින් සැපවත් වීම", "isCorrect": true},
          {"text": "සියලු සත්ත්වයින්ගේ සතුටට සතුටු වීම", "isCorrect": false},
          {"text": "සියලු සත්ත්වයින් කෙරෙහි උපේක්ෂාවෙන් සිටීම", "isCorrect": false},
          {"text": "සියලු සත්ත්වයින්ගේ දුක් දුරු කිරීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! මෛත්‍රී භාවනාවේ ප්‍රධාන අරමුණ සියලු සත්ත්වයින් සැපවත් වීම බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. මෛත්‍රී භාවනාවේ ප්‍රධාන අරමුණ සියලු සත්ත්වයින් සැපවත් වීමයි. අනෙක් තේරීම් කරුණා, මුදිතා, සහ උපේක්ෂා යන අනෙකුත් බ්‍රහ්ම විහාරයන්ට අදාළ වේ. මෛත්‍රිය යනු සියලු සත්ත්වයින් කෙරෙහි අසීමිත හිතවත්කම හා ආදරය වැඩීමයි. එය වෛරය, ක්‍රෝධය හා බියෙන් තොර මනසක් වර්ධනය කරයි. මෙම භාවනාව මගින් අප තුළ සහ අන් අය තුළ සතුට හා සුවය ඇති කිරීමට අපේක්ෂා කෙරේ. එය මමත්වය අඩු කර, සර්ව සත්ත්ව කරුණාව වර්ධනය කරයි."},
  {
    "title": "විසුද්ධි මාර්ගයේ සඳහන් විශුද්ධි කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 73,
    "choices": [
          {"text": "12", "isCorrect": false},
          {"text": "7", "isCorrect": true},
          {"text": "9", "isCorrect": false},
          {"text": "5", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! විසුද්ධි මාර්ගයේ විශුද්ධි 7ක් ඇති බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. විසුද්ධි මාර්ගයේ විශුද්ධි 7ක් තිබේ. මේවා සීල විශුද්ධිය, චිත්ත විශුද්ධිය, දිට්ඨි විශුද්ධිය, කංඛාවිතරණ විශුද්ධිය, මග්ගාමග්ගඤාණදස්සන විශුද්ධිය, පටිපදාඤාණදස්සන විශුද්ධිය, සහ ඤාණදස්සන විශුද්ධිය යන ඒවායි. මෙම විශුද්ධි 7 නිවන් මග සඳහා අනුපිළිවෙලින් පිරිසිදු කළ යුතු අංග 7ක් ලෙස සැලකේ. සීලයෙන් ආරම්භ වී, සමාධිය දියුණු කර, ප්‍රඥාව වර්ධනය කරමින් අවසානයේ සම්පූර්ණ විමුක්තිය කරා යන ගමන මෙම විශුද්ධි 7 මගින් විස්තර කෙරේ."},
  {
    "title": "චතුරාර්ය සත්‍යයන්හි තෙවන සත්‍යය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 74,
    "choices": [
          {"text": "දුක්ඛ සත්‍යය", "isCorrect": false},
          {"text": "සමුදය සත්‍යය", "isCorrect": false},
          {"text": "නිරෝධ සත්‍යය", "isCorrect": true},
          {"text": "මග්ග සත්‍යය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! චතුරාර්ය සත්‍යයන්හි තෙවන සත්‍යය නිරෝධ සත්‍යය බව ඔබ නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. චතුරාර්ය සත්‍යයන්හි තෙවන සත්‍යය නිරෝධ සත්‍යයි. මෙය දුකේ නිරෝධය හෙවත් නිවන පිළිබඳ සත්‍යය වේ. නිරෝධ සත්‍යය යනු දුක නිරුද්ධ වීම, එනම් තණ්හාව සම්පූර්ණයෙන්ම ඉවත් වීමෙන් ලබන නිවන් සුවයයි. මෙය සියලු දුක්, කණගාටු, හා අතෘප්තිකර තත්ත්වයන්ගෙන් සම්පූර්ණයෙන් නිදහස් වූ අවස්ථාවයි. බුදුරජාණන් වහන්සේ මෙය 'පරම සැපත' ලෙස හඳුන්වා ඇත."},
  {
    "title": "පටිච්චසමුප්පාදයේ 'ජාති' යන්නෙන් අදහස් වන්නේ කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 75,
    "choices": [
          {"text": "මව්කුසෙහි පිළිසිඳ ගැනීම පමණි", "isCorrect": false},
          {"text": "නව භවයක ස්කන්ධයන්ගේ පහළවීම", "isCorrect": true},
          {"text": "ළදරු උපත පමණි", "isCorrect": false},
          {"text": "වයස්ගත වීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! 'ජාති' යන්නෙන් අදහස් වන්නේ නව භවයක ස්කන්ධයන්ගේ පහළවීම බව ඔබ හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. පටිච්චසමුප්පාදයේ 'ජාති' යන්නෙන් අදහස් වන්නේ නව භවයක ස්කන්ධයන්ගේ පහළවීමයි. මෙය මනුෂ්‍ය ලෝකයේ උපතට පමණක් සීමා නොවේ. 'ජාති' යනු ඕනෑම භව තලයක (කාම, රූප, අරූප) නව ජීවිතයක ආරම්භයයි. එය රූප, වේදනා, සඤ්ඤා, සංඛාර, විඤ්ඤාණ යන පංචස්කන්ධයේ නව පැවැත්මක් ආරම්භ වීමයි. මෙය කර්මානුරූපව සිදුවන ප්‍රතිසන්ධිය හෙවත් නැවත භවයක පිළිසිඳ ගැනීමයි."},
  {
    "title": "ප්‍රඥාවේ ප්‍රධාන වර්ග කීයක් තිබේද?",
    "required": true,
    "points": 1,
    "index": 76,
    "choices": [
          {"text": "5", "isCorrect": false},
          {"text": "3", "isCorrect": true},
          {"text": "4", "isCorrect": false},
          {"text": "2", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ප්‍රඥාවේ ප්‍රධාන වර්ග 3ක් ඇති බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. ප්‍රඥාවේ ප්‍රධාන වර්ග 3ක් තිබේ. මේවා සුතමය පඤ්ඤා (ඇසීමෙන් ලබන ප්‍රඥාව), චින්තාමය පඤ්ඤා (සිතීමෙන් ලබන ප්‍රඥාව), සහ භාවනාමය පඤ්ඤා (භාවනාවෙන් ලබන ප්‍රඥාව) යන ඒවායි. සුතමය පඤ්ඤාව දහම් ඇසීමෙන් හා කියවීමෙන් ලැබෙන දැනුමයි. චින්තාමය පඤ්ඤාව තර්කානුකූලව සිතා බැලීමෙන් ලබන අවබෝධයයි. භාවනාමය පඤ්ඤාව නිරන්තර භාවනා පුහුණුවෙන් ලබන ගැඹුරු අවබෝධයයි. මෙම තුන එකිනෙක වර්ධනය වී අවසානයේ සම්පූර්ණ ප්‍රඥාව කරා ළඟා වේ."},
  {
    "title": "බුද්ධ දේශනාවට අනුව, සතර සතිපට්ඨානය මොනවාද?",
    "required": true,
    "points": 1,
    "index": 77,
    "choices": [
          {"text": "කායානුපස්සනා, වේදනානුපස්සනා, චිත්තානුපස්සනා, ධම්මානුපස්සනා", "isCorrect": true},
          {"text": "මෙත්තා, කරුණා, මුදිතා, උපේක්ඛා", "isCorrect": false},
          {"text": "දාන, සීල, භාවනා, පඤ්ඤා", "isCorrect": false},
          {"text": "දුක්ඛ, සමුදය, නිරෝධ, මග්ග", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ සතර සතිපට්ඨානය නිවැරදිව හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. සතර සතිපට්ඨානය නම් කායානුපස්සනා (කය පිළිබඳ සිහිය), වේදනානුපස්සනා (වේදනා පිළිබඳ සිහිය), චිත්තානුපස්සනා (සිත පිළිබඳ සිහිය), සහ ධම්මානුපස්සනා (ධර්මතා පිළිබඳ සිහිය) යන ඒවායි. මෙය බුද්ධ දේශනාවේ වැදගත් භාවනා ක්‍රමයකි. කායානුපස්සනාව මගින් ශරීරයේ ක්‍රියාකාරකම් හා ස්වභාවය පිළිබඳ අවධානය යොමු කෙරේ. වේදනානුපස්සනාව මගින් සැප, දුක්, උපේක්ෂා යන වේදනා අවබෝධ කර ගැනීම සිදු කෙරේ. චිත්තානුපස්සනාව මගින් සිතේ විවිධ ස්වභාවයන් නිරීක්ෂණය කෙරේ. ධම්මානුපස්සනාව මගින් ධර්මතා හෙවත් මානසික හා භෞතික සංසිද්ධීන් පිළිබඳ අවධානය යොමු කෙරේ. මෙම සතර සතිපට්ඨානය පුහුණු කිරීමෙන් සම්පූර්ණ මානසික හා ශාරීරික අවබෝධය ලබා ගත හැකි යැයි බුදුරජාණන් වහන්සේ දේශනා කර ඇත."},
  {
    "title": "චිත්ත වීථියේ ජවන අවස්ථාවේදී සාමාන්‍යයෙන් කොපමණ චිත්තක්ෂණ ගණනක් ගත වේද?",
    "required": true,
    "points": 1,
    "index": 78,
    "choices": [
          {"text": "5", "isCorrect": false},
          {"text": "9", "isCorrect": false},
          {"text": "12", "isCorrect": false},
          {"text": "7", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! ජවන අවස්ථාවේදී සාමාන්‍යයෙන් චිත්තක්ෂණ 7ක් ගත වන බව ඔබ හොඳින් දනී.",
    "feedbackIncorrect": "වැරදියි. චිත්ත වීථියේ ජවන අවස්ථාවේදී සාමාන්‍යයෙන් චිත්තක්ෂණ 7ක් ගත වේ. මෙය අරමුණේ බලවත් භාවය අනුව වෙනස් විය හැකි නමුත්, සාමාන්‍යයෙන් 7ක් ලෙස සැලකේ. ජවන යනු අරමුණ රස විඳින අවස්ථාවයි. මෙම අවස්ථාවේදී කුසල හෝ අකුසල කර්ම රැස් වේ. ජවන චිත්ත 7 සාමාන්‍ය පුද්ගලයන්ගේ චිත්ත වීථියේ වැදගත්ම කොටසයි. බුදුරජාණන් වහන්සේ වැනි උත්තමයන්ට මෙය 4ක් දක්වා අඩු විය හැකි අතර, අපායගත සත්ත්වයන්ට 5ක් දක්වා අඩු විය හැකිය. මෙම ජවන චිත්ත මගින් කර්ම සකස් වීම සිදු වන බැවින් ඒවා ඉතා වැදගත් වේ."},
  {
    "title": "අකුශල චෛතසික කීයක් ඇත්තේ ය?",
    "required": true,
    "points": 1,
    "index": 79,
    "choices": [
          {"text": "දහයක්", "isCorrect": false},
          {"text": "විස්සක්", "isCorrect": false},
          {"text": "දහසයක්", "isCorrect": true},
          {"text": "විසි පහක්", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ පාඩම හොඳින් කියවා ඇත.",
    "feedbackIncorrect": "වැරදියි. පාඩමේ සඳහන් වන පරිදි අකුශල චෛතසික දහසයක් ඇත. මෙම චෛතසික සියල්ල අකුසල් සිත් සමඟ පමණක් පහළ වන බව සිහි තබා ගන්න. මෙම දහසය චෛතසික වන්නේ: මෝහය, අහිරිකය, අනොත්තප්පය, උද්ධච්චය, ලෝභය, දිට්ඨිය, මානය, දෝසය, ඉස්සාවය, මච්ඡරිය, කුක්කුච්චය, ථීනය, මිද්ධය, විචිකිච්ඡාවය යන ඒවායි. මේවායින් මෝහය සෑම අකුසල් සිතකම පවතින අතර, අනෙක් ඒවා විවිධ අකුසල් සිත් වල විවිධාකාරයෙන් පහළ වේ. මෙම චෛතසික අවබෝධ කර ගැනීමෙන් අපගේ මනස තුළ ඇතිවන අකුසල් ස්වභාවයන් හඳුනාගෙන ඒවා පාලනය කර ගැනීමට උපකාරී වේ."},
  {
    "title": "මෝහය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 80,
    "choices": [
          {"text": "සිතට ආරම්මණය ගැන උදාසීන වන ස්වභාවය", "isCorrect": false},
          {"text": "සිතට ආරම්මණයේ ඇති සැටිය හසු කර ගැනීමට ඉඩ දෙන ස්වභාවය", "isCorrect": false},
          {"text": "සිතට ආරම්මණය පැහැදිලිව පෙනෙන ස්වභාවය", "isCorrect": false},
          {"text": "සිතට ආරම්මණයේ ඇති සැටිය හසු කර ගත නොහැකි සැටියට ආවරණය කරන ස්වභාවය", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! ඔබ මෝහය පිළිබඳ නිවැරදි අවබෝධයක් ලබා ඇත.",
    "feedbackIncorrect": "වැරදියි. මෝහය යනු සිතට ආරම්මණයේ ඇති සැටිය හසු කර ගත නොහැකි සැටියට ආවරණය කරන ස්වභාවයයි. එය සත්‍යයට වැසුමක් ලෙස ක්‍රියා කරයි, මිනිසුන්ට යථාර්ථය දැකීමට බාධා කරමින්. මෝහය නිසා අපට ඇත්ත තත්ත්වය වටහා ගැනීමට නොහැකි වේ. එය අවිද්‍යාව ලෙසද හැඳින්වේ. මෝහය නිසා දුක සැප ලෙසත්, අනිත්‍ය දේ නිත්‍ය ලෙසත්, අනාත්ම දේ ආත්ම ලෙසත් වරදවා ගනී. මෝහය සෑම අකුසල් සිතකම පවතින අතර, එය ඉවත් කිරීම සඳහා ප්‍රඥාව වැඩීම අවශ්‍ය වේ."},
  {
    "title": "අහිරිකය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 81,
    "choices": [
          {"text": "පාපයට ලැජ්ජා වන ස්වභාවය", "isCorrect": false},
          {"text": "පාපයට බිය වන ස්වභාවය", "isCorrect": false},
          {"text": "පාපය පිළිකුල් කරන ස්වභාවය", "isCorrect": false},
          {"text": "පාපය පිළිකුල් නොකරන ස්වභාවය", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! ඔබ අහිරිකය පිළිබඳව හොඳ අවබෝධයක් පෙන්නුම් කරයි.",
    "feedbackIncorrect": "වැරදියි. අහිරිකය යනු පාපය පිළිකුල් නොකරන ස්වභාවයයි. එය පාපයට ලැජ්ජා නොවීමේ මානසික තත්ත්වයයි, එමගින් අකුසල් සිදු කිරීමට පහසු කරයි. අහිරික පුද්ගලයා පාපකර්ම කිරීමට බියක් හෝ ලැජ්ජාවක් නොදක්වයි. මෙය ඉතා භයානක මානසික තත්ත්වයක් වන අතර, එය පුද්ගලයා තව තවත් අකුසල් කරා ඇද දමයි. අහිරිකය ප්‍රතිපක්ෂ කුසල ධර්මය වන්නේ හිරියයි, එනම් පාපයට ලැජ්ජා වීමයි. හිරිය වැඩීමෙන් අහිරිකය දුරු කළ හැකිය."},
  {
    "title": "අනොත්තප්පය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 82,
    "choices": [
          {"text": "පාපයට ලැජ්ජා වන ස්වභාවය", "isCorrect": false},
          {"text": "පාපයට බිය නොවන ස්වභාවය", "isCorrect": true},
          {"text": "පාපයට බිය වන ස්වභාවය", "isCorrect": false},
          {"text": "පාපය ප්‍රතික්ෂේප කරන ස්වභාවය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ අනොත්තප්පය පිළිබඳව නිවැරදි අවබෝධයක් පෙන්නුම් කරයි.",
    "feedbackIncorrect": "වැරදියි. අනොත්තප්පය යනු පාපයට බිය නොවන ස්වභාවයයි. එය පාපයේ ප්‍රතිවිපාක ගැන සැලකිලිමත් නොවීමේ මානසික තත්ත්වයයි, එමගින් අකුසල් සිදු කිරීමට තවදුරටත් පහසු කරයි. අනොත්තප්ප පුද්ගලයා පාපකර්මවල ප්‍රතිවිපාක ගැන නොසිතා කටයුතු කරයි. මෙය අහිරිකය සමඟ එක්ව ඉතා බලවත් අකුසල් ජනක චෛතසිකයක් වේ. අනොත්තප්පයේ ප්‍රතිපක්ෂ කුසල ධර්මය වන්නේ ඔත්තප්පයයි, එනම් පාපයට බිය වීමයි. ඔත්තප්පය වැඩීමෙන් අනොත්තප්පය දුරු කළ හැකිය."},
  {
    "title": "උද්ධච්චය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 83,
    "choices": [
          {"text": "සිතේ එකඟ බව", "isCorrect": false},
          {"text": "සිතේ සන්සුන් ස්වභාවය", "isCorrect": false},
          {"text": "සිතේ සැලෙන ස්වභාවය", "isCorrect": true},
          {"text": "සිතේ නිහඬ ස්වභාවය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ උද්ධච්චය පිළිබඳව හොඳ අවබෝධයක් පෙන්නුම් කරයි.",
    "feedbackIncorrect": "වැරදියි. උද්ධච්චය යනු සිතේ සැලෙන ස්වභාවයයි. එය සිත අස්ථාවර කරන, එකඟතාවයට බාධා කරන මානසික සාධකයකි. උද්ධච්චය නිසා සිත එක අරමුණක නොපිහිටා චංචල වේ. මෙය භාවනා වැඩීමේදී විශේෂයෙන් බාධාවක් වන අතර, සාමාන්‍ය ජීවිතයේදීද අවධානය යොමු කිරීමට බාධාවක් වේ. උද්ධච්චයේ ප්‍රතිපක්ෂය වන්නේ සමාධියයි. සමාධිය වැඩීමෙන් උද්ධච්චය පාලනය කළ හැකිය."},
  {
    "title": "ලෝභය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 84,
    "choices": [
          {"text": "ආරම්මණය පිළිබඳ බිය ඇති කරන ස්වභාවය", "isCorrect": false},
          {"text": "ආරම්මණය පිළිබඳ උදාසීන ස්වභාවය", "isCorrect": false},
          {"text": "ආරම්මණය ප්‍රතික්ෂේප කරන ස්වභාවය", "isCorrect": false},
          {"text": "ආරම්මණය ආශ්වාදනීය දෙයක් වශයෙන් ගෙන එහි ඇලෙන ස්වභාවය", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! ඔබ ලෝභය පිළිබඳව නිවැරදි අවබෝධයක් පෙන්නුම් කරයි.",
    "feedbackIncorrect": "වැරදියි. ලෝභය යනු ආරම්මණය ආශ්වාදනීය දෙයක් වශයෙන් ගෙන එහි ඇලෙන ස්වභාවයයි. එය දේවල් හා අත්දැකීම් 'අල්ලා ගැනීමේ' හා ඒවාට ඇලී සිටීමේ මානසික ස්වභාවයයි. ලෝභය එක් ප්‍රධාන අකුසල මූලයක් වන අතර, එය දුකට හේතු වේ. ලෝභය නිසා පුද්ගලයා තව තවත් දේවල් පසුපස හඹා යයි, නමුත් කිසි විටෙකත් සෑහීමකට පත් නොවේ. ලෝභයේ ප්‍රතිපක්ෂය වන්නේ අලෝභය හෙවත් ත්‍යාගශීලී බවයි. දාන පාරමිතාව වැඩීමෙන් ලෝභය දුරු කළ හැකිය."},
  {
    "title": "දිට්ඨිය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 85,
    "choices": [
          {"text": "යථාර්ථය පිළිබඳ සැක ඇති කරන ස්වභාවය", "isCorrect": false},
          {"text": "යථාර්ථය පිළිබඳ උදාසීන ස්වභාවය", "isCorrect": false},
          {"text": "කාරණය වරදවා ගන්නා වූ වරදවා දක්නා වූ ස්වභාවය", "isCorrect": true},
          {"text": "යථාර්ථය නිවැරදිව දැකීමේ ස්වභාවය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ දිට්ඨිය පිළිබඳව හොඳ අවබෝධයක් පෙන්නුම් කරයි.",
    "feedbackIncorrect": "වැරදියි. දිට්ඨිය යනු කාරණය වරදවා ගන්නා වූ වරදවා දක්නා වූ ස්වභාවයයි. එය යථාර්ථය වැරදියට අවබෝධ කර ගැනීමට හේතු වන මිථ්‍යා දෘෂ්ටියකි. දිට්ඨිය නිසා පුද්ගලයා අනිත්‍ය, දුක්ඛ, අනාත්ම යන ත්‍රිලක්ෂණය නොදැක, දේවල් නිත්‍ය, සුඛ, ආත්ම ලෙස වරදවා ගනී. මෙය ඉතා බලවත් අකුසල චෛතසිකයක් වන අතර, නිවන් මඟට බරපතල බාධාවකි. දිට්ඨියේ ප්‍රතිපක්ෂය වන්නේ සම්මා දිට්ඨිය හෙවත් නිවැරදි දැක්මයි. ප්‍රඥාව වැඩීමෙන් දිට්ඨිය දුරු කළ හැකිය."},
  {
    "title": "මානය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 86,
    "choices": [
          {"text": "තමා උසස් කොට සැලකීමේ ස්වභාවය", "isCorrect": true},
          {"text": "තමා පහත් කොට සැලකීමේ ස්වභාවය", "isCorrect": false},
          {"text": "තමා හා අන් අය සම කොට සැලකීමේ ස්වභාවය", "isCorrect": false},
          {"text": "තමා ගැන උදාසීන වීමේ ස්වභාවය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ මානය පිළිබඳව නිවැරදි අවබෝධයක් පෙන්නුම් කරයි.",
    "feedbackIncorrect": "වැරදියි. මානය යනු තමා උසස් කොට සැලකීමේ ස්වභාවයයි. එය තමා ගැන අධික ලෙස ඇගයීමේ හා අන් අය හා සැසඳීමේ මානසික ස්වභාවයයි. මානය තුන් ආකාර වේ: සෙය්‍යමානය (තමා අන් අයට වඩා උසස් යැයි සිතීම), සදිසමානය (තමා අන් අය හා සමාන යැයි සිතීම), හීනමානය (තමා අන් අයට වඩා පහත් යැයි සිතීම). මානය නිසා පුද්ගලයා තමා ගැන වැරදි ආකල්පයක් ඇති කර ගනී, එය සමාජ සබඳතා වලට බාධාවක් වේ. මානයේ ප්‍රතිපක්ෂය වන්නේ නිහතමානී බවයි. මෛත්‍රී භාවනාව වැඩීමෙන් මානය අඩු කර ගත හැකිය."},
  {
    "title": "දෝසය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 87,
    "choices": [
          {"text": "ආරම්මණයට විරුද්ධ වන ස්වභාවය", "isCorrect": true},
          {"text": "ආරම්මණය පිළිබඳ කුතුහලය ඇති කරන ස්වභාවය", "isCorrect": false},
          {"text": "ආරම්මණය පිළිබඳ උදාසීන ස්වභාවය", "isCorrect": false},
          {"text": "ආරම්මණයට ආදරය කරන ස්වභාවය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ දෝසය පිළිබඳව හොඳ අවබෝධයක් පෙන්නුම් කරයි.",
    "feedbackIncorrect": "වැරදියි. දෝසය යනු ආරම්මණයට විරුද්ධ වන ස්වභාවයයි. එය අප්‍රිය දේ කෙරෙහි ඇති වන අමනාප හා විරෝධී මානසික ස්වභාවයයි. දෝසය ලෝභය සමඟ ප්‍රධාන අකුසල මූලයකි. එය කෝපය, ක්‍රෝධය, වෛරය, පළිගැනීම් සිතුවිලි ආදී රූපවලින් පහළ විය හැකිය. දෝසය නිසා මානසික හා කායික පීඩා ඇති වේ. එය සමාජ සබඳතා විනාශ කරයි. දෝසයේ ප්‍රතිපක්ෂය වන්නේ අදෝසය හෙවත් මෛත්‍රියයි. මෛත්‍රී භාවනාව වැඩීමෙන් දෝසය දුරු කළ හැකිය."},
  {
    "title": "ඊර්ෂ්‍යාව යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 88,
    "choices": [
          {"text": "අනුන්ගේ සම්පත් පිළිබඳ උදාසීන ස්වභාවය", "isCorrect": false},
          {"text": "අනුන්ගේ සම්පත් නො ඉවසන ස්වභාවය", "isCorrect": true},
          {"text": "අනුන්ගේ සම්පත් දැක සතුටු වන ස්වභාවය", "isCorrect": false},
          {"text": "අනුන්ගේ සම්පත් ගැන කනගාටු වන ස්වභාවය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ ඊර්ෂ්‍යාව පිළිබඳව නිවැරදි අවබෝධයක් පෙන්නුම් කරයි.",
    "feedbackIncorrect": "වැරදියි. ඊර්ෂ්‍යාව යනු අනුන්ගේ සම්පත් නො ඉවසන ස්වභාවයයි. එය අන් අයගේ සාර්ථකත්වය හෝ වාසනාව දැක ඇතිවන අප්‍රසන්න හැඟීමකි. ඊර්ෂ්‍යාව දෝසයේ එක් ස්වරූපයකි. එය පුද්ගලයාගේ මානසික සුවය නැති කරන අතර, සමාජ සබඳතා වලට හානි කරයි. ඊර්ෂ්‍යාව නිසා පුද්ගලයා අන් අයගේ අසාර්ථකත්වය පතයි. ඊර්ෂ්‍යාවේ ප්‍රතිපක්ෂය වන්නේ මුදිතාව හෙවත් සහ සතුටයි. මුදිතා භාවනාව වැඩීමෙන් ඊර්ෂ්‍යාව දුරු කළ හැකිය."},
  {
    "title": "මච්ඡරිය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 89,
    "choices": [
          {"text": "තමා සතු දේ අන් අයට දීමට කැමති වන ස්වභාවය", "isCorrect": false},
          {"text": "තමා සතු දේ අන් අයට දීමට අකමැති වන ස්වභාවය", "isCorrect": true},
          {"text": "තමා සතු දේ විනාශ කර දැමීමට කැමති වන ස්වභාවය", "isCorrect": false},
          {"text": "තමා සතු දේ ගැන උදාසීන වන ස්වභාවය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ මච්ඡරිය පිළිබඳව හොඳ අවබෝධයක් පෙන්නුම් කරයි.",
    "feedbackIncorrect": "වැරදියි. මච්ඡරිය යනු තමා සතු දේ අන් අයට දීමට අකමැති වන ස්වභාවයයි. එය මසුරු කම හෝ තමා සතු දේ තදින් අල්ලාගෙන සිටීමේ මානසික ස්වභාවයයි. මච්ඡරිය ද දෝසයේ එක් ස්වරූපයකි. එය පංච විධ මච්ඡරිය ලෙස දක්වා ඇත: ආවාස මච්ඡරිය, කුල මච්ඡරිය, ලාභ මච්ඡරිය, වණ්ණ මච්ඡරිය, ධම්ම මච්ඡරිය. මච්ඡරිය නිසා පුද්ගලයා තමා සතු දේ අන් අයට භුක්ති විඳීමට ඉඩ නොදේ. මච්ඡරියේ ප්‍රතිපක්ෂය වන්නේ චාගය හෙවත් ත්‍යාගශීලී බවයි. දාන පාරමිතාව වැඩීමෙන් මච්ඡරිය දුරු කළ හැකිය."},
  {
    "title": "කුක්කුච්චය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 90,
    "choices": [
          {"text": "කළ අයහපත් දේ ගැන සතුටු වන ස්වභාවය", "isCorrect": false},
          {"text": "කළ පව් හා නොකළ පින් ගැන පසුතැවෙන ස්වභාවය", "isCorrect": true},
          {"text": "කළ පව් හා නොකළ පින් ගැන උදාසීන වන ස්වභාවය", "isCorrect": false},
          {"text": "කළ යහපත් දේ ගැන සතුටු වන ස්වභාවය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ කුක්කුච්චය පිළිබඳව නිවැරදි අවබෝධයක් පෙන්නුම් කරයි.",
    "feedbackIncorrect": "වැරදියි. කුක්කුච්චය යනු කළ පව් හා නොකළ පින් ගැන පසුතැවෙන ස්වභාවයයි. එය කළ වැරදි හා නොකළ යහපත් දේ ගැන ඇතිවන පසුතැවිල්ල හා කනගාටුවයි. කුක්කුච්චය ද දෝසයේ එක් ස්වරූපයකි. එය දෙආකාර වේ: කළ පව් ගැන පසුතැවීම සහ නොකළ කුසල් ගැන පසුතැවීම. කුක්කුච්චය නිසා මානසික අසහනය ඇති වන අතර, එය භාවනාවට බාධාවකි. කුක්කුච්චයේ ප්‍රතිපක්ෂය වන්නේ අවංක පසුතාපය හා අධිෂ්ඨානයයි. සීලය පිරිසිදුව රැකීමෙන් හා නිරන්තරයෙන් කුසල් කිරීමෙන් කුක්කුච්චය දුරු කළ හැකිය."},
  {
    "title": "ථීනය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 91,
    "choices": [
          {"text": "සිතේ ගිලන් බව හා දුබල බව", "isCorrect": true},
          {"text": "සිතේ පැහැදිලි බව", "isCorrect": false},
          {"text": "සිතේ ශක්තිමත් බව", "isCorrect": false},
          {"text": "සිතේ සක්‍රීය ස්වභාවය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ ථීනය පිළිබඳව හොඳ අවබෝධයක් පෙන්නුම් කරයි.",
    "feedbackIncorrect": "වැරදියි. ථීනය යනු සිතේ ගිලන් බව හා දුබල බවයි. එය සිතේ අකර්මණ්‍යතාව හා මන්දගාමී බව නිරූපණය කරන මානසික සාධකයකි. ථීනය නිසා සිත අලස වී කුසල් කිරීමට අකමැති වේ. එය නීවරණයක් වන ථීනමිද්ධයේ කොටසකි. ථීනය බෝධි පාක්ෂික ධර්ම වැඩීමට බාධාවකි. ථීනයේ ප්‍රතිපක්ෂය වන්නේ වීර්යයයි. ආලෝක සඤ්ඤාව, ඉරියාපථ පරිවර්තනය, ධාතු මනසිකාරය වැනි භාවනා ක්‍රම මගින් ථීනය දුරු කළ හැකිය."},
  {
    "title": "මිද්ධය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 92,
    "choices": [
          {"text": "කායික අලසකම හා නිද්‍රාශීලීත්වය", "isCorrect": true},
          {"text": "කායික පිබිදීම", "isCorrect": false},
          {"text": "කායික ක්‍රියාශීලීත්වය", "isCorrect": false},
          {"text": "කායික ශක්තිය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ මිද්ධය පිළිබඳව නිවැරදි අවබෝධයක් පෙන්නුම් කරයි.",
    "feedbackIncorrect": "වැරදියි. මිද්ධය යනු කායික අලසකම හා නිද්‍රාශීලීත්වයයි. එය ශරීරයේ මන්දගාමී බව හා නිදිමත ගතිය නිරූපණය කරන මානසික සාධකයකි. මිද්ධය ථීනය සමඟ එක්ව ථීනමිද්ධ නීවරණය සාදයි. මිද්ධය නිසා ශරීරය බර ගතියක් ගනී, නිදිමත ගතියක් ඇති වේ. එය බෝධි පාක්ෂික ධර්ම වැඩීමට බාධාවකි. මිද්ධයේ ප්‍රතිපක්ෂය වන්නේ ද වීර්යයයි. ථීනය දුරු කිරීමට යොදා ගන්නා ක්‍රම මිද්ධය දුරු කිරීමටද භාවිත කළ හැකිය."},
  {
    "title": "විචිකිච්ඡාව යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 93,
    "choices": [
          {"text": "අරමුණු කරන දෙය පිළිබඳ නොසැලකිලිමත් බව", "isCorrect": false},
          {"text": "අරමුණු කරන දෙය පිළිබඳ විනිශ්චයක් නැති බව", "isCorrect": true},
          {"text": "අරමුණු කරන දෙය පිළිබඳ තීරණාත්මක බව", "isCorrect": false},
          {"text": "අරමුණු කරන දෙය පිළිබඳ පැහැදිලි අවබෝධය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ විචිකිච්ඡාව පිළිබඳව හොඳ අවබෝධයක් පෙන්නුම් කරයි.",
    "feedbackIncorrect": "වැරදියි. විචිකිච්ඡාව යනු අරමුණු කරන දෙය පිළිබඳ විනිශ්චයක් නැති බවයි. එය සැකය, අවිශ්වාසය හෝ අනිශ්චිතතාව නිරූපණය කරන මානසික සාධකයකි. විචිකිච්ඡාව බුද්ධාදී රත්නත්‍රය, කර්මඵල, පූර්වාපර ජීවිත ආදිය පිළිබඳ සැක ඇති කරයි. එය පංච නීවරණයන්ගෙන් එකකි. විචිකිච්ඡාව නිසා තීරණ ගැනීමට නොහැකි වීම, අවිශ්වාසය, සැකය ආදිය ඇති වේ. විචිකිච්ඡාවේ ප්‍රතිපක්ෂය වන්නේ ශ්‍රද්ධාව හා ප්‍රඥාවයි. ධර්මය ශ්‍රවණය කිරීම, සාකච්ඡා කිරීම, භාවනා කිරීම ආදිය මගින් විචිකිච්ඡාව දුරු කළ හැකිය."},
  {
    "title": "මෝහය කෙලෙස් අතර කුමන ස්ථානයක් දරයිද?",
    "required": true,
    "points": 1,
    "index": 94,
    "choices": [
          {"text": "ප්‍රධාන කෙලෙස් තුනෙන් එකක්", "isCorrect": true},
          {"text": "කුසල් සාධකයක්", "isCorrect": false},
          {"text": "අප්‍රධාන කෙලෙසක්", "isCorrect": false},
          {"text": "කෙලෙස් අතර නොමැති සාධකයක්", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ මෝහයේ වැදගත්කම හොඳින් වටහාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. මෝහය ලෝභ, දෝස සමඟ ප්‍රධාන කෙලෙස් තුනෙන් එකක් ලෙස සැලකේ. එය අවිද්‍යාව හෝ නොදැනුවත්කම නියෝජනය කරයි. මෝහය සියලු අකුසල් වල මූලය වන අතර, සෑම අකුසල් සිතකම පවතී. එය සත්‍යය වසන් කරමින් යථාර්ථය දැකීමට බාධා කරයි. මෝහය නිසා පුද්ගලයා දුක සැප ලෙසත්, අනිත්‍ය නිත්‍ය ලෙසත්, අනාත්ම ආත්ම ලෙසත් වරදවා ගනී. මෝහයේ ප්‍රතිපක්ෂය වන්නේ ප්‍රඥාවයි. ශීල, සමාධි, ප්‍රඥා යන ත්‍රිශික්ෂාව වැඩීමෙන් මෝහය දුරු කළ හැකිය."},
  {
    "title": "අහිරික හා අනොත්තප්ප යන චෛතසික දෙක අකුසල පක්ෂයේ කුමන ලෙස හැඳින්වේද?",
    "required": true,
    "points": 1,
    "index": 95,
    "choices": [
          {"text": "මහා බල දෙකක්", "isCorrect": true},
          {"text": "දුර්වල සාධක දෙකක්", "isCorrect": false},
          {"text": "මධ්‍යස්ථ සාධක දෙකක්", "isCorrect": false},
          {"text": "අප්‍රධාන සාධක දෙකක්", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ මෙම චෛතසික දෙකෙහි බලවත් භූමිකාව හොඳින් අවබෝධ කරගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. අහිරික හා අනොත්තප්ප යන චෛතසික දෙක අකුසල පක්ෂයේ මහා බල දෙකක් ලෙස සැලකේ. මේවා පාපකර්ම සිදුකිරීමට ඇති බාධක ඉවත් කරයි. අහිරිකය පාපයට ලැජ්ජා නොවීමයි, අනොත්තප්පය පාපයට බිය නොවීමයි. මේ දෙක නිසා පුද්ගලයා නිර්භයව පාපකර්ම කරයි. මේවායේ ප්‍රතිපක්ෂ කුසල ධර්ම වන්නේ හිරි (පාපයට ලැජ්ජා වීම) හා ඔත්තප්ප (පාපයට බිය වීම) යි. හිරි ඔත්තප්ප වැඩීමෙන් අහිරික අනොත්තප්ප දුරු කළ හැකිය."},
  {
    "title": "උද්ධච්චය සහ ඒකග්ගතාව අතර සම්බන්ධය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 96,
    "choices": [
          {"text": "සමාන ගුණාංග ඇති සාධක දෙකක්", "isCorrect": false},
          {"text": "එකිනෙකට උපකාර වන සාධක දෙකක්", "isCorrect": false},
          {"text": "එකිනෙකට ප්‍රතිවිරුද්ධ සාධක දෙකක්", "isCorrect": true},
          {"text": "කිසිදු සම්බන්ධයක් නැති සාධක දෙකක්", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ මෙම චෛතසික දෙක අතර ඇති විරුද්ධ සම්බන්ධය හොඳින් වටහාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. උද්ධච්චය සහ ඒකග්ගතාව එකිනෙකට ප්‍රතිවිරුද්ධ සාධක දෙකක් වේ. උද්ධච්චය සිත විසිරීමට හේතු වන අතර, ඒකග්ගතාව සිත එක් අරමුණක පිහිටුවයි. උද්ධච්චය අකුසල චෛතසිකයක් වන අතර, ඒකග්ගතාව සෝභන සාධාරණ චෛතසිකයකි. උද්ධච්චය සමාධියට බාධාවක් වන අතර, ඒකග්ගතාව සමාධිය ගොඩනගයි. උද්ධච්චය පාලනය කිරීමෙන් ඒකග්ගතාව වර්ධනය කළ හැකිය. සමථ භාවනාව වැඩීමෙන් උද්ධච්චය අඩු කර ඒකග්ගතාව වැඩි කර ගත හැකිය."},
  {
    "title": "ලෝභයේ ප්‍රධාන ලක්ෂණය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 97,
    "choices": [
          {"text": "ආරම්මණය කෙරෙහි උදාසීන වීම", "isCorrect": false},
          {"text": "ආරම්මණය ප්‍රතික්ෂේප කිරීම", "isCorrect": false},
          {"text": "ආරම්මණය ආශ්වාදනීය දෙයක් ලෙස ගෙන එහි ඇලීම", "isCorrect": true},
          {"text": "ආරම්මණය කෙරෙහි භය ඇති වීම", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ ලෝභයේ මූලික ස්වභාවය හොඳින් හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. ලෝභයේ ප්‍රධාන ලක්ෂණය වන්නේ ආරම්මණය ආශ්වාදනීය දෙයක් ලෙස ගෙන එහි ඇලීමයි. මෙය තණ්හාව හෝ දැඩි ආශාව නිර්මාණය කරයි. ලෝභය නිසා පුද්ගලයා අරමුණේ ගිලී යයි, එය අත් නොහැර සිටියි. ලෝභය ප්‍රධාන අකුසල මූලයක් වන අතර, එය දුකට හේතු වේ. ලෝභය නිසා පුද්ගලයා තව තවත් දේවල් පසුපස හඹා යයි, නමුත් කිසි විටෙකත් සෑහීමකට පත් නොවේ. ලෝභයේ ප්‍රතිපක්ෂය වන්නේ අලෝභය හෙවත් ත්‍යාගශීලී බවයි. දාන පාරමිතාව වැඩීමෙන් ලෝභය දුරු කළ හැකිය."},
  {
    "title": "දිට්ඨිය සහ සම්මාදිට්ඨිය අතර වෙනස කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 98,
    "choices": [
          {"text": "දෙකම එකම දෙයකි", "isCorrect": false},
          {"text": "දිට්ඨිය වැරදි දැක්ම වන අතර සම්මාදිට්ඨිය නිවැරදි දැක්මයි", "isCorrect": true},
          {"text": "දෙකම අකුසල චෛතසික වේ", "isCorrect": false},
          {"text": "දිට්ඨිය නිවැරදි දැක්ම වන අතර සම්මාදිට්ඨිය වැරදි දැක්මයි", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ දිට්ඨිය හා සම්මාදිට්ඨිය අතර ඇති වැදගත් වෙනස හොඳින් වටහාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. දිට්ඨිය යනු වැරදි දැක්ම හෝ මිථ්‍යා දෘෂ්ටිය වන අතර, සම්මාදිට්ඨිය යනු නිවැරදි දැක්ම හෝ සම්‍යක් දෘෂ්ටියයි. දිට්ඨිය අකුසල චෛතසිකයක් වන අතර සම්මාදිට්ඨිය කුසල චෛතසිකයකි. දිට්ඨිය නිසා පුද්ගලයා යථාර්ථය වරදවා වටහා ගනී, උදාහරණයක් ලෙස අනිත්‍ය දේ නිත්‍ය ලෙස දැකීම. සම්මාදිට්ඨිය නිසා පුද්ගලයා යථාර්ථය නිවැරදිව දකී, උදාහරණයක් ලෙස අනිත්‍ය දේ අනිත්‍ය ලෙස දැකීම. දිට්ඨිය සංසාර චක්‍රයේ පුද්ගලයා සිරකර තබන අතර, සම්මාදිට්ඨිය නිවන් මඟ විවර කරයි. දිට්ඨිය දුරු කිරීම සඳහා සම්මාදිට්ඨිය වැඩීම අවශ්‍ය වේ."},
  {
    "title": "මානය කොපමණ ආකාර වේද?",
    "required": true,
    "points": 1,
    "index": 99,
    "choices": [
          {"text": "එක් ආකාරයකි", "isCorrect": false},
          {"text": "තුන් ආකාරයකි", "isCorrect": true},
          {"text": "දෙආකාරයකි", "isCorrect": false},
          {"text": "හතර ආකාරයකි", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ මානයේ විවිධ ආකාර පිළිබඳව හොඳ අවබෝධයක් පෙන්නුම් කරයි.",
    "feedbackIncorrect": "වැරදියි. මානය තුන් ආකාරයකි: සෙය්‍යමානය (තමා උසස් යැයි සිතීම), සදිසමානය (තමා සමාන යැයි සිතීම), හා හීනමානය (තමා පහත් යැයි සිතීම). සෙය්‍යමානය නිසා පුද්ගලයා තමා අන් අයට වඩා උසස් යැයි සිතයි. සදිසමානය නිසා තමා අන් අය හා සමාන යැයි සිතයි. හීනමානය නිසා තමා අන් අයට වඩා පහත් යැයි සිතයි. මේ තුනම අකුසල චෛතසික වන අතර, ඒවා නිවන් මඟට බාධාවකි. මානය දුරු කිරීම සඳහා නිහතමානී බව වැඩිය යුතුය. මෛත්‍රී භාවනාව වැඩීමෙන් මානය අඩු කර ගත හැකිය."},
  {
    "title": "දෝසය පිළිබඳව පහත ප්‍රකාශ වලින් නිවැරදි වන්නේ කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 100,
    "choices": [
          {"text": "දෝසය කිසි විටෙකත් භය හෝ පිළිකුල් ආකාරයෙන් නොපවතී", "isCorrect": false},
          {"text": "දෝසය සෑම විටම ප්‍රකට ලෙස පෙනෙන කෝපයක් ලෙස පවතී", "isCorrect": false},
          {"text": "දෝසය කෝපය, භය, පිළිකුල යන ආකාර වලින් පැවතිය හැකිය", "isCorrect": true},
          {"text": "දෝසය සහ කෝපය සම්පූර්ණයෙන්ම වෙනස් චෛතසික දෙකකි", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ දෝසයේ විවිධ ප්‍රකාශන ආකාර පිළිබඳව හොඳ අවබෝධයක් පෙන්නුම් කරයි.",
    "feedbackIncorrect": "වැරදියි. දෝසය කෝපය, භය, පිළිකුල යන ආකාර වලින් පැවතිය හැකිය. මෙය දෝසයේ බහුවිධ ස්වභාවය පෙන්නුම් කරයි. දෝසය ප්‍රධාන අකුසල මූලයක් වන අතර, එය විවිධාකාරයෙන් ප්‍රකාශ විය හැකිය. කෝපය ලෙස පැවතෙන විට එය ප්‍රකට ලෙස පෙනෙන අතර, භය හෝ පිළිකුල ලෙස පැවතෙන විට එතරම් ප්‍රකට නොවිය හැකිය. කෙසේ වෙතත්, මේ සියල්ලම දෝසයේ විවිධ ප්‍රකාශන මාදිලි වේ. දෝසය දුරු කිරීම සඳහා මෛත්‍රිය, කරුණාව වැනි බ්‍රහ්මවිහාර ධර්ම වැඩිය යුතුය."},
  {
    "title": "ඊර්ෂ්‍යාව සහ මච්ඡරිය අතර ප්‍රධාන වෙනස කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 101,
    "choices": [
          {"text": "ඊර්ෂ්‍යාව තමා සතු දේ ගැන වන අතර මච්ඡරිය අනුන් සතු දේ ගැන වේ", "isCorrect": false},
          {"text": "ඊර්ෂ්‍යාව සහ මච්ඡරිය අතර කිසිදු වෙනසක් නොමැත", "isCorrect": false},
          {"text": "ඊර්ෂ්‍යාව කුසල චෛතසිකයක් වන අතර මච්ඡරිය අකුසල චෛතසිකයකි", "isCorrect": false},
          {"text": "ඊර්ෂ්‍යාව අනුන්ගේ සම්පත් නො ඉවසන අතර මච්ඡරිය තමා සතු දේ අන් අයට දීමට අකමැති වේ", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! ඔබ ඊර්ෂ්‍යාව සහ මච්ඡරිය අතර ඇති වැදගත් වෙනස හොඳින් හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. ඊර්ෂ්‍යාව අනුන්ගේ සම්පත් නො ඉවසන අතර මච්ඡරිය තමා සතු දේ අන් අයට දීමට අකමැති වීමයි. දෙකම අකුසල චෛතසික වුවද, ඒවායේ අරමුණු වෙනස් වේ."},
  {
    "title": "කුක්කුච්චය යනු හැම විටම කුසල චෛතසිකයක්ද?",
    "required": true,
    "points": 1,
    "index": 102,
    "choices": [
          {"text": "කුක්කුච්චය කුසල හෝ අකුසල නොවන උපේක්ෂා සහගත චෛතසිකයකි", "isCorrect": false},
          {"text": "ඔව්, කුක්කුච්චය සෑම විටම කුසල චෛතසිකයකි", "isCorrect": false},
          {"text": "කුක්කුච්චය සමහර විට කුසල, සමහර විට අකුසල විය හැකිය", "isCorrect": false},
          {"text": "නැත, කුක්කුච්චය සෑම විටම අකුසල චෛතසිකයකි", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! ඔබ කුක්කුච්චයේ ස්වභාවය නිවැරදිව තේරුම් ගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. කුක්කුච්චය සෑම විටම අකුසල චෛතසිකයකි. එය කළ පව් හා නොකළ කුසල් ගැන පසුතැවීම නිසා ඇතිවන මානසික පීඩාවයි."},
  {
    "title": "ථීනය සහ මිද්ධය අතර ප්‍රධාන වෙනස කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 103,
    "choices": [
          {"text": "ථීනය කුසල වන අතර මිද්ධය අකුසල වේ", "isCorrect": false},
          {"text": "ථීනය සහ මිද්ධය අතර කිසිදු වෙනසක් නැත", "isCorrect": false},
          {"text": "ථීනය කායික වන අතර මිද්ධය මානසික වේ", "isCorrect": false},
          {"text": "ථීනය මානසික වන අතර මිද්ධය කායික වේ", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! ඔබ ථීනය සහ මිද්ධය අතර ඇති වැදගත් වෙනස හොඳින් හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. ථීනය මානසික අලසකම හෝ සිතේ මන්දගාමී බව වන අතර මිද්ධය කායික අලසකම හෝ ශරීරයේ මන්දගාමී බවයි. දෙකම අකුසල චෛතසික වේ."},
  {
    "title": "විචිකිච්ඡාව බෞද්ධ ඉගැන්වීම් වල කොපමණ ආකාර වලින් විස්තර කර ඇත්ද?",
    "required": true,
    "points": 1,
    "index": 104,
    "choices": [
          {"text": "හය ආකාරයකින්", "isCorrect": false},
          {"text": "අට ආකාරයකින්", "isCorrect": true},
          {"text": "දොළොස් ආකාරයකින්", "isCorrect": false},
          {"text": "දහ ආකාරයකින්", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ විචිකිච්ඡාව පිළිබඳ බෞද්ධ ඉගැන්වීම් හොඳින් මතක තබාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. විචිකිච්ඡාව බෞද්ධ ඉගැන්වීම් වල අට ආකාරයකින් විස්තර කර ඇත. මේවා බුදුන්, ධර්මය, සංඝයා, ශික්ෂාව, අතීතය, අනාගතය, අතීත-අනාගත දෙකම, සහ පටිච්චසමුප්පාදය පිළිබඳ සැක ඇතුළත් වේ."},
  {
    "title": "මෝහය සහ අවිද්‍යාව අතර සම්බන්ධය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 105,
    "choices": [
          {"text": "මෝහය අවිද්‍යාවට වඩා දරුණු තත්ත්වයකි", "isCorrect": false},
          {"text": "මෝහය සහ අවිද්‍යාව එකම දෙයකි", "isCorrect": true},
          {"text": "මෝහය සහ අවිද්‍යාව සම්පූර්ණයෙන්ම වෙනස් ධර්මතා දෙකකි", "isCorrect": false},
          {"text": "අවිද්‍යාව මෝහයට වඩා දරුණු තත්ත්වයකි", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ මෝහය සහ අවිද්‍යාව අතර ඇති සමානතාවය හොඳින් වටහාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. මෝහය සහ අවිද්‍යාව එකම දෙයකි. මෙය යථාර්ථය නොදැනීම හෝ වැරදියට තේරුම් ගැනීම යන අර්ථය දෙන වචන දෙකකි."},
  {
    "title": "අහිරික සහ අනොත්තප්ප චෛතසික කුමන ආකාරයේ සිත්වල පහළ වේද?",
    "required": true,
    "points": 1,
    "index": 106,
    "choices": [
          {"text": "සියලුම සිත්වල", "isCorrect": false},
          {"text": "ක්‍රියා සිත්වල පමණි", "isCorrect": false},
          {"text": "අකුසල් සිත්වල පමණි", "isCorrect": true},
          {"text": "කුසල් සිත්වල පමණි", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ අහිරික සහ අනොත්තප්ප චෛතසිකවල ස්වභාවය හොඳින් වටහාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. අහිරික සහ අනොත්තප්ප චෛතසික අකුසල් සිත්වල පමණක් පහළ වේ. මේවා පාපයට ලැජ්ජා නොවීම හා බිය නොවීම නියෝජනය කරන බැවින් අකුසල් සිත්වලට පමණක් සීමා වේ."},
  {
    "title": "උද්ධච්චය සහ විචිකිච්ඡාව අතර ප්‍රධාන වෙනස කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 107,
    "choices": [
          {"text": "උද්ධච්චය කුසල චෛතසිකයක් වන අතර විචිකිච්ඡාව අකුසල චෛතසිකයකි", "isCorrect": false},
          {"text": "උද්ධච්චය සිත විසිරවන අතර විචිකිච්ඡාව සිත දෙගිඩියාවෙන් තබයි", "isCorrect": true},
          {"text": "උද්ධච්චය සිත එක අරමුණක පිහිටුවන අතර විචිකිච්ඡාව සිත විසිරවයි", "isCorrect": false},
          {"text": "උද්ධච්චය සහ විචිකිච්ඡාව අතර කිසිදු වෙනසක් නැත", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ උද්ධච්චය සහ විචිකිච්ඡාව අතර ඇති වැදගත් වෙනස හොඳින් හඳුනාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. උද්ධච්චය සිත විසිරවන අතර විචිකිච්ඡාව සිත දෙගිඩියාවෙන් තබයි. උද්ධච්චය සිතේ චංචල ස්වභාවය නියෝජනය කරන අතර විචිකිච්ඡාව සැක සහිත ස්වභාවය නියෝජනය කරයි."},
  {
    "title": "ලෝභය, දිට්ඨිය සහ මානය අතර ඇති සම්බන්ධය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 108,
    "choices": [
          {"text": "මේවා තුනම එකම චෛතසිකයේ විවිධ නම් පමණි", "isCorrect": false},
          {"text": "මේවා හැමවිටම එකට පහළ වන චෛතසික වේ", "isCorrect": false},
          {"text": "මේවා එකිනෙකට සම්පූර්ණයෙන්ම වෙනස් චෛතසික වේ", "isCorrect": false},
          {"text": "ලෝභය මූලික වන අතර දිට්ඨිය හා මානය එයින් පැන නගින චෛතසික වේ", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! ඔබ ලෝභය, දිට්ඨිය සහ මානය අතර ඇති සංකීර්ණ සම්බන්ධය හොඳින් වටහාගෙන ඇත.",
    "feedbackIncorrect": "වැරදියි. ලෝභය මූලික වන අතර දිට්ඨිය හා මානය එයින් පැන නගින චෛතසික වේ. ලෝභය 'මම' සහ 'මගේ' යන සංකල්ප නිර්මාණය කරන අතර, දිට්ඨිය වැරදි දැක්ම සහ මානය අහංකාරය නියෝජනය කරයි."},
  {
    "title": "මෝහය යනු කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 109,
    "choices": [
          {"text": "යථාර්ථය නොදැකීම හෝ වැරදියට දැකීම", "isCorrect": true},
          {"text": "යථාර්ථය දැකීමේ හැකියාව", "isCorrect": false},
          {"text": "අනාගතය පුරෝකථනය කිරීමේ හැකියාව", "isCorrect": false},
          {"text": "සතුටු සිතිවිලි ඇති කිරීමේ හැකියාව", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! මෝහය යනු යථාර්ථය නොදැකීම හෝ වැරදියට දැකීමයි.",
    "feedbackIncorrect": "වැරදියි. මෝහය යනු යථාර්ථය නොදැකීම හෝ වැරදියට දැකීමයි. එය බුදුදහමේ මූලික අකුසල මූලයක් ලෙස සැලකේ."},
  {
    "title": "ලෝභය කෙසේ ප්‍රකාශ වේද?",
    "required": true,
    "points": 1,
    "index": 110,
    "choices": [
          {"text": "අන් අයට උපකාර කිරීමේ ආශාව ලෙස", "isCorrect": false},
          {"text": "තමා ගැන පහත් හැඟීමක් ලෙස", "isCorrect": false},
          {"text": "සත්‍යය සොයා යාමේ උනන්දුව ලෙස", "isCorrect": false},
          {"text": "දේවල් අත්හැරීමේ අපහසුතාවය ලෙස", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! ලෝභය බොහෝ විට දේවල් අත්හැරීමේ අපහසුතාවය ලෙස ප්‍රකාශ වේ.",
    "feedbackIncorrect": "වැරදියි. ලෝභය බොහෝ විට දේවල් අත්හැරීමේ අපහසුතාවය ලෙස ප්‍රකාශ වේ. එය දේවල් හෝ අත්දැකීම් 'අල්ලාගැනීමේ' මානසික ස්වභාවයයි."},
  {
    "title": "දෝසය සහ ඊර්ෂ්‍යාව අතර ඇති සම්බන්ධය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 111,
    "choices": [
          {"text": "දෙකම එකම චෛතසිකයයි", "isCorrect": false},
          {"text": "ඊර්ෂ්‍යාව දෝසයේ එක් ආකාරයකි", "isCorrect": true},
          {"text": "දෙක අතර කිසිදු සම්බන්ධයක් නැත", "isCorrect": false},
          {"text": "දෝසය ඊර්ෂ්‍යාවේ එක් ආකාරයකි", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඊර්ෂ්‍යාව දෝසයේ එක් ආකාරයක් ලෙස සැලකිය හැකිය.",
    "feedbackIncorrect": "වැරදියි. ඊර්ෂ්‍යාව දෝසයේ එක් ආකාරයක් ලෙස සැලකිය හැකිය. එය අන් අයගේ සාර්ථකත්වය හෝ වාසනාව කෙරෙහි ඇති වන අප්‍රසන්න හැඟීමකි."},
  {
    "title": "මානය සහ දිට්ඨිය අතර ප්‍රධාන වෙනස කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 112,
    "choices": [
          {"text": "මානය තමා ගැන ඇගයීමක් වන අතර දිට්ඨිය ලෝකය ගැන දැක්මකි", "isCorrect": true},
          {"text": "මානය පුද්ගලයන්ට පමණක් අදාළ වන අතර දිට්ඨිය අදේවවාදීන්ට පමණක් අදාළ වේ", "isCorrect": false},
          {"text": "මානය 'මම' යන හැඟීම පදනම් වන අතර දිට්ඨිය 'මගේ' යන හැඟීම පදනම් වේ", "isCorrect": false},
          {"text": "මානය සෑම විටම ධනාත්මක වන අතර දිට්ඨිය සෑම විටම ඍණාත්මක වේ", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! මානය තමා ගැන ඇගයීමක් වන අතර දිට්ඨිය ලෝකය ගැන දැක්මකි.",
    "feedbackIncorrect": "වැරදියි. මානය තමා ගැන ඇගයීමක් (උදා: මම හොඳයි, නරකයි) වන අතර දිට්ඨිය ලෝකය ගැන දැක්මකි (උදා: ශාශ්වතවාදය, උච්ඡේදවාදය)."},
  {
    "title": "කුක්කුච්චය එදිනෙදා ජීවිතයේදී කෙසේ අත්විඳිය හැකිද?",
    "required": true,
    "points": 1,
    "index": 113,
    "choices": [
          {"text": "කළ වැරැද්දක් ගැන හෝ නොකළ යහපත් දෙයක් ගැන පසුතැවීමක් ලෙස", "isCorrect": true},
          {"text": "යමක් කළ පසු ඇතිවන තෘප්තිමත් හැඟීමක් ලෙස", "isCorrect": false},
          {"text": "යමක් කිරීමට පෙර ඇතිවන සතුටක් ලෙස", "isCorrect": false},
          {"text": "අනාගතය ගැන ඇතිවන බලවත් බලාපොරොත්තුවක් ලෙස", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! කුක්කුච්චය බොහෝ විට කළ වැරැද්දක් ගැන හෝ නොකළ යහපත් දෙයක් ගැන පසුතැවීමක් ලෙස අත්විඳිය හැකිය.",
    "feedbackIncorrect": "වැරදියි. කුක්කුච්චය බොහෝ විට කළ වැරැද්දක් ගැන හෝ නොකළ යහපත් දෙයක් ගැන පසුතැවීමක් ලෙස අත්විඳිය හැකිය. එය පශ්චාත්තාපයේ හෝ වරද පිළිගැනීමේ හැඟීමක් නොවේ."},
  {
    "title": "ථීන-මිද්ධය භාවනාවට ඇති කරන බලපෑම කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 114,
    "choices": [
          {"text": "භාවනාවේදී ආනාපානසතිය වැඩිදියුණු කරයි", "isCorrect": false},
          {"text": "භාවනාවේදී මනස වඩාත් සක්‍රීය කරයි", "isCorrect": false},
          {"text": "භාවනාව වඩාත් ගැඹුරු කිරීමට උපකාරී වේ", "isCorrect": false},
          {"text": "භාවනාවේ ප්‍රගතියට බාධා කරයි", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! ථීන-මිද්ධය භාවනාවේ ප්‍රගතියට බාධා කරයි.",
    "feedbackIncorrect": "වැරදියි. ථීන-මිද්ධය භාවනාවේ ප්‍රගතියට බාධා කරයි. එය මානසික අලසකම හා ශාරීරික මන්දගාමීත්වය ඇති කරන බැවින් සමාධිය වර්ධනය වීමට බාධා කරයි."},
  {
    "title": "විචිකිච්ඡාව ධර්ම මාර්ගයේ ප්‍රගතියට කෙසේ බලපායිද?",
    "required": true,
    "points": 1,
    "index": 115,
    "choices": [
          {"text": "එය ධර්ම මාර්ගයේ ප්‍රගතියට උපකාරී වේ", "isCorrect": false},
          {"text": "එය ධර්ම මාර්ගයේ ප්‍රගතියට කිසිදු බලපෑමක් නොකරයි", "isCorrect": false},
          {"text": "එය ධර්ම මාර්ගයේ ප්‍රගතිය වේගවත් කරයි", "isCorrect": false},
          {"text": "එය ධර්ම මාර්ගයේ ප්‍රගතියට බාධා කරයි", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! විචිකිච්ඡාව ධර්ම මාර්ගයේ ප්‍රගතියට බාධා කරයි.",
    "feedbackIncorrect": "වැරදියි. විචිකිච්ඡාව ධර්ම මාර්ගයේ ප්‍රගතියට බාධා කරයි. එය බුදුන්, ධර්මය, සංඝයා ආදිය කෙරෙහි සැක ඇති කරමින් ශ්‍රද්ධාව දුර්වල කරයි."},
  {
    "title": "අකුසල චෛතසික අතරින් කුමක්ද සෝවාන් මාර්ගයෙන් ප්‍රහීණ වන්නේ?",
    "required": true,
    "points": 1,
    "index": 116,
    "choices": [
          {"text": "දෝසය", "isCorrect": false},
          {"text": "දිට්ඨිය", "isCorrect": true},
          {"text": "ලෝභය", "isCorrect": false},
          {"text": "මානය", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! සෝවාන් මාර්ගයෙන් දිට්ඨිය ප්‍රහීණ වේ.",
    "feedbackIncorrect": "වැරදියි. සෝවාන් මාර්ගයෙන් දිට්ඨිය ප්‍රහීණ වේ. මෙය සක්කාය දිට්ඨිය හෙවත් 'මම' යන මිථ්‍යා දෘෂ්ටිය ඉවත් වීමයි."},
  {
    "title": "උද්ධච්චය යනු කුමක්ද සහ එය කෙසේ හඳුනාගත හැකිද?",
    "required": true,
    "points": 1,
    "index": 117,
    "choices": [
          {"text": "මානසික චංචලභාවය, සිත විසිරී යාමෙන්", "isCorrect": true},
          {"text": "මානසික සංසුන්භාවය, සිත එක්තැන් වීමෙන්", "isCorrect": false},
          {"text": "මානසික අවසාදය, දුක් සිතිවිලි ඇති වීමෙන්", "isCorrect": false},
          {"text": "මානසික ප්‍රීතිය, සතුටු සිතිවිලි ඇති වීමෙන්", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! උද්ධච්චය යනු මානසික චංචලභාවයයි, එය සිත විසිරී යාමෙන් හඳුනාගත හැකිය.",
    "feedbackIncorrect": "වැරදියි. උද්ධච්චය යනු මානසික චංචලභාවයයි, එය සිත විසිරී යාමෙන් හඳුනාගත හැකිය. එය එකාග්‍රතාවයට බාධා කරන අකුසල චෛතසිකයකි."},
  {
    "title": "අහිරික සහ අනොත්තප්ප අතර සම්බන්ධය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 118,
    "choices": [
          {"text": "ඒවා එකිනෙකට සහයෝගයෙන් ක්‍රියා කරන චෛතසික දෙකකි", "isCorrect": true},
          {"text": "ඒවා එකිනෙකට විරුද්ධ චෛතසික දෙකකි", "isCorrect": false},
          {"text": "ඒවා එකම චෛතසිකයේ දෙපැත්තකි", "isCorrect": false},
          {"text": "ඒවා අතර කිසිදු සම්බන්ධයක් නොමැත", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! අහිරික සහ අනොත්තප්ප එකිනෙකට සහයෝගයෙන් ක්‍රියා කරන චෛතසික දෙකකි.",
    "feedbackIncorrect": "වැරදියි. අහිරික සහ අනොත්තප්ප එකිනෙකට සහයෝගයෙන් ක්‍රියා කරන චෛතසික දෙකකි. අහිරික පාපයට ලැජ්ජා නොවීම නම් වන අතර, අනොත්තප්ප පාපයට බිය නොවීම නම් වේ."},
  {
    "title": "මච්ඡරිය යනු කුමක්ද සහ එය කෙසේ ජය ගත හැකිද?",
    "required": true,
    "points": 1,
    "index": 119,
    "choices": [
          {"text": "අන් අයගේ සම්පත් දැක සතුටු වීම, කරුණාව වැඩීමෙන්", "isCorrect": false},
          {"text": "තමා සතු දෑ බෙදා නොගැනීමේ ආශාව, දානය පුරුදු කිරීමෙන්", "isCorrect": true},
          {"text": "අන් අයට උදව් කිරීමේ ආශාව, උපේක්ෂාව වැඩීමෙන්", "isCorrect": false},
          {"text": "තමා ගැන ඉහළ අදහසක් තබා ගැනීම, නිහතමානී බව වැඩීමෙන්", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! මච්ඡරිය යනු තමා සතු දෑ බෙදා නොගැනීමේ ආශාවයි, එය දානය පුරුදු කිරීමෙන් ජය ගත හැකිය.",
    "feedbackIncorrect": "වැරදියි. මච්ඡරිය යනු තමා සතු දෑ බෙදා නොගැනීමේ ආශාවයි. එය දානය පුරුදු කිරීමෙන් ජය ගත හැකිය. දානය මච්ඡරියට ප්‍රතිවිරුද්ධ ගුණාංගයකි."},
  {
    "title": "කුක්කුච්චය සහ විචිකිච්ඡාව අතර වෙනස කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 120,
    "choices": [
          {"text": "කුක්කුච්චය පසුතැවිල්ල වන අතර විචිකිච්ඡාව සැකයයි", "isCorrect": true},
          {"text": "කුක්කුච්චය සහ විචිකිච්ඡාව අතර කිසිදු වෙනසක් නැත", "isCorrect": false},
          {"text": "කුක්කුච්චය කුසල චෛතසිකයක් වන අතර විචිකිච්ඡාව අකුසල චෛතසිකයකි", "isCorrect": false},
          {"text": "කුක්කුච්චය අතීතය ගැන වන අතර විචිකිච්ඡාව අනාගතය ගැන වේ", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! කුක්කුච්චය පසුතැවිල්ල වන අතර විචිකිච්ඡාව සැකයයි.",
    "feedbackIncorrect": "වැරදියි. කුක්කුච්චය පසුතැවිල්ල වන අතර විචිකිච්ඡාව සැකයයි. කුක්කුච්චය කළ දේ හෝ නොකළ දේ ගැන පසුතැවීම වන අතර, විචිකිච්ඡාව බුදුන්, ධම්ම, සංඝ ආදිය ගැන සැක කිරීමයි."},
  {
    "title": "ථීන-මිද්ධය ජය ගැනීමට බුදුරජාණන් වහන්සේ දේශනා කළ ක්‍රම මොනවාද?",
    "required": true,
    "points": 1,
    "index": 121,
    "choices": [
          {"text": "භාවනාව අත්හැර දැමීම සහ විනෝදාස්වාද ක්‍රියාවල නිරත වීම", "isCorrect": false},
          {"text": "වැඩිපුර නිදා ගැනීම සහ ආහාර වැඩිපුර ගැනීම", "isCorrect": false},
          {"text": "තව තවත් අකුසල් සිතිවිලි ගැන සිතීම", "isCorrect": false},
          {"text": "ආලෝක සංඥාව, ඉරියව් මාරු කිරීම, පිරිසිදු වාතාශ්‍රය ලබා ගැනීම", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! ආලෝක සංඥාව, ඉරියව් මාරු කිරීම, පිරිසිදු වාතාශ්‍රය ලබා ගැනීම ආදිය ථීන-මිද්ධය ජය ගැනීමට උපකාරී වේ.",
    "feedbackIncorrect": "වැරදියි. බුදුරජාණන් වහන්සේ ආලෝක සංඥාව, ඉරියව් මාරු කිරීම, පිරිසිදු වාතාශ්‍රය ලබා ගැනීම ආදිය ථීන-මිද්ධය ජය ගැනීමට උපකාරී වන බව දේශනා කළ සේක."},
  {
    "title": "විචිකිච්ඡාව ප්‍රහාණය කිරීමේ වැදගත්කම කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 122,
    "choices": [
          {"text": "එය ධර්ම මාර්ගයේ ප්‍රගතියට අත්‍යවශ්‍ය නැත", "isCorrect": false},
          {"text": "එය සෝවාන් මාර්ගයට බාධාවකි", "isCorrect": true},
          {"text": "එය බුද්ධ ශාසනයේ වැදගත් නොවන අංගයකි", "isCorrect": false},
          {"text": "එය ප්‍රහාණය කිරීම අවශ්‍ය නැත", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! විචිකිච්ඡාව සෝවාන් මාර්ගයට බාධාවකි, එබැවින් එය ප්‍රහාණය කිරීම වැදගත්ය.",
    "feedbackIncorrect": "වැරදියි. විචිකිච්ඡාව සෝවාන් මාර්ගයට බාධාවකි. එය ප්‍රහාණය කිරීම ධර්ම මාර්ගයේ ප්‍රගතියට අත්‍යවශ්‍ය වේ."},
  {
    "title": "මෝහය සහ අවිද්‍යාව අතර සම්බන්ධය කුමක්ද?",
    "required": true,
    "points": 1,
    "index": 123,
    "choices": [
          {"text": "ඒවා එකම දෙයක වෙනස් නම් දෙකකි", "isCorrect": true},
          {"text": "මෝහය අවිද්‍යාවට වඩා බලවත් ය", "isCorrect": false},
          {"text": "අවිද්‍යාව මෝහයට වඩා බලවත් ය", "isCorrect": false},
          {"text": "ඒවා සම්පූර්ණයෙන්ම වෙනස් ධර්මතා දෙකකි", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! මෝහය සහ අවිද්‍යාව යනු එකම දෙයක වෙනස් නම් දෙකකි.",
    "feedbackIncorrect": "වැරදියි. මෝහය සහ අවිද්‍යාව යනු එකම දෙයක වෙනස් නම් දෙකකි. දෙකම යථාර්ථය නොදැනීම හෝ වැරදියට තේරුම් ගැනීම හැඳින්වීමට යොදා ගනී."},
  {
    "title": "පරමාර්ථ ධර්ම හා සම්මුති ධර්ම අතර සම්බන්ධය විග්‍රහ කරන විට, චිත්ත වීථි ප්‍රක්‍රියාව තුළ භවාංග චිත්තය සහ ජවන චිත්තය අතර සම්බන්ධය කෙසේ විස්තර කළ හැකිද?",
    "required": true,
    "points": 2,
    "index": 124,
    "choices": [
          {"text": "භවාංග චිත්තය සම්මුති ධර්මයක් වන අතර ජවන චිත්තය පරමාර්ථ ධර්මයක් ලෙස ක්‍රියා කරයි", "isCorrect": false},
          {"text": "භවාංග චිත්තය පරමාර්ථ ධර්මයක් වන අතර ජවන චිත්තය සම්මුති ධර්මයක් ලෙස ක්‍රියා කරයි", "isCorrect": false},
          {"text": "භවාංග චිත්තය හා ජවන චිත්තය යන දෙකම සම්මුති ධර්ම වන අතර ඒවා අතර අන්තර් ක්‍රියාව පරමාර්ථ ස්වභාවයක් ගනී", "isCorrect": false},
          {"text": "භවාංග චිත්තය හා ජවන චිත්තය යන දෙකම පරමාර්ථ ධර්ම වුවද, ඒවා අතර අන්තර් ක්‍රියාව සම්මුති ස්වභාවයක් ගනී", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! ඔබ චිත්ත වීථි ප්‍රක්‍රියාවේ සංකීර්ණ ස්වභාවය අවබෝධ කරගෙන ඇත. භවාංග චිත්තය හා ජවන චිත්තය යන දෙකම පරමාර්ථ ධර්ම වුවද, ඒවා අතර සම්බන්ධය සහ අන්තර් ක්‍රියාව සම්මුති මට්ටමේ දී විස්තර කිරීමට සිදු වේ. මෙය පරමාර්ථ හා සම්මුති යථාර්ථයන් අතර සංකීර්ණ සම්බන්ධය පෙන්නුම් කරයි.",
    "feedbackIncorrect": "වැරදියි. මෙය සංකීර්ණ ප්‍රශ්නයකි. භවාංග චිත්තය හා ජවන චිත්තය යන දෙකම පරමාර්ථ ධර්ම වේ. කෙසේ වෙතත්, ඒවා අතර සම්බන්ධය සහ අන්තර් ක්‍රියාව සම්මුති මට්ටමේ දී විස්තර කිරීමට සිදු වේ. මෙය පරමාර්ථ හා සම්මුති යථාර්ථයන් අතර ඇති සංකීර්ණ සම්බන්ධය පෙන්නුම් කරයි."},
  {
    "title": "චේතනා චෛතසිකය සහ කර්මය අතර ඇති සම්බන්ධය සලකා බලන විට, අභිධර්මයේ දැක්වෙන පරිදි 'එකන්තකුසල' හා 'අනියත' කර්ම අතර වෙනස කුමක්ද, සහ මෙම වෙනස ත්‍රිපිටකයේ දැක්වෙන 'ගරුක කර්ම' සංකල්පය සමඟ කෙසේ සැසඳිය හැකිද?",
    "required": true,
    "points": 2,
    "index": 125,
    "choices": [
          {"text": "එකන්තකුසල කර්ම හා අනියත කර්ම අතර වෙනසක් නැත; ගරුක කර්ම යනු ඉතා බලවත් අකුසල කර්ම පමණි", "isCorrect": false},
          {"text": "එකන්තකුසල කර්ම හා අනියත කර්ම යන දෙකම නියත විපාක ගෙන දේ; ගරුක කර්ම යනු මෙම දෙවර්ගයෙන් පිටත ඇති තෙවන කර්ම වර්ගයකි", "isCorrect": false},
          {"text": "එකන්තකුසල කර්ම සෑම විටම කුසල විපාක ගෙන දෙන අතර, අනියත කර්ම විවිධ විපාක ගෙන දිය හැකිය; ගරුක කර්ම යනු එකන්තකුසල කර්මවල එක් වර්ගයකි", "isCorrect": false},
          {"text": "එකන්තකුසල කර්ම නියත විපාක ගෙන දෙන අතර, අනියත කර්ම අනියත විපාක ගෙන දේ; ගරුක කර්ම එකන්තකුසල හෝ එකන්තාකුසල විය හැකි අතර සෑම විටම පළමුව විපාක දේ", "isCorrect": true}],
    "feedbackCorrect": "නිවැරදියි! ඔබ කර්ම සිද්ධාන්තයේ සංකීර්ණ අංශ පිළිබඳ ගැඹුරු අවබෝධයක් පෙන්නුම් කරයි. එකන්තකුසල කර්ම නියත විපාක ගෙන දෙන අතර, අනියත කර්ම අනියත විපාක ගෙන දේ. ගරුක කර්ම (බරපතල කර්ම) එකන්තකුසල හෝ එකන්තාකුසල විය හැකි අතර, ඒවා සෑම විටම ප්‍රමුඛතාවය ගනිමින් පළමුව විපාක දේ.",
    "feedbackIncorrect": "වැරදියි. මෙය සංකීර්ණ ප්‍රශ්නයකි. එකන්තකුසල කර්ම නියත විපාක ගෙන දෙන අතර, අනියත කර්ම අනියත විපාක ගෙන දේ. ගරුක කර්ම (බරපතල කර්ම) එකන්තකුසල හෝ එකන්තාකුසල විය හැකි අතර, ඒවා සෑම විටම ප්‍රමුඛතාවය ගනිමින් පළමුව විපාක දේ. මෙය කර්ම සිද්ධාන්තයේ වැදගත් සහ සංකීර්ණ අංශයකි."},
  {
    "title": "අභිධර්මයේ දැක්වෙන පරිදි, රූප කලාප න්‍යාය සහ ක්ෂණික නිරෝධ සිද්ධාන්තය එකට සලකා බැලීමේදී, පටිච්චසමුප්පාද චක්‍රයේ 'ජරා-මරණ' අංගය කෙසේ අර්ථ නිරූපණය කළ හැකිද?",
    "required": true,
    "points": 2,
    "index": 126,
    "choices": [
          {"text": "ජරා-මරණ යනු රූප හා නාම ධර්මවල ස්ථිර පැවැත්මයි", "isCorrect": false},
          {"text": "ජරා-මරණ යනු රූප කලාප පරම්පරාවේ ක්‍රමික වෙනස්වීම හා අවසන් නිරෝධයයි", "isCorrect": true},
          {"text": "ජරා-මරණ යනු එක් රූප කලාපයක ක්ෂණික නිරෝධයයි", "isCorrect": false},
          {"text": "ජරා-මරණ යනු රූප කලාප සම්පූර්ණයෙන් විනාශ වී යාමයි", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ රූප කලාප න්‍යාය, ක්ෂණික නිරෝධ සිද්ධාන්තය, සහ පටිච්චසමුප්පාදය අතර ඇති සංකීර්ණ සම්බන්ධය අවබෝධ කරගෙන ඇත. ජරා-මරණ යනු හුදෙක් එක් රූප කලාපයක නිරෝධය නොව, රූප කලාප පරම්පරාවේ ක්‍රමික වෙනස්වීම හා අවසන් නිරෝධයයි. මෙය ක්ෂණික නිරෝධය සහ දීර්ඝකාලීන වෙනස්වීම් යන දෙකම නියෝජනය කරයි.",
    "feedbackIncorrect": "වැරදියි. මෙය සංකීර්ණ ප්‍රශ්නයකි. ජරා-මරණ යනු රූප කලාප පරම්පරාවේ ක්‍රමික වෙනස්වීම හා අවසන් නිරෝධයයි. මෙය හුදෙක් එක් රූප කලාපයක නිරෝධය නොව, ක්ෂණික නිරෝධය සහ දීර්ඝකාලීන වෙනස්වීම් යන දෙකම නියෝජනය කරයි. මෙය රූප කලාප න්‍යාය, ක්ෂණික නිරෝධ සිද්ධාන්තය, සහ පටිච්චසමුප්පාදය අතර ඇති සංකීර්ණ සම්බන්ධය පෙන්නුම් කරයි."},
  {
    "title": "නාම-රූප පරිච්ඡේද ඥානය සහ පච්චය පරිග්ගහ ඥානය යන විදර්ශනා ඥාන දෙක සලකා බලන විට, මේවා කෙසේ අභිධර්මයේ සඳහන් වන කාමාවචර ජවන වීථි සමඟ සම්බන්ධ වේද, සහ මෙම සම්බන්ධය තදාරම්මණ සහ වෝට්ඨපන චිත්ත සමඟ කෙසේ සැසඳිය හැකිද?",
    "required": true,
    "points": 2,
    "index": 127,
    "choices": [
          {"text": "මෙම විදර්ශනා ඥාන තදාරම්මණ චිත්ත තුළ පමණක් ක්‍රියා කරයි", "isCorrect": false},
          {"text": "මෙම විදර්ශනා ඥාන දෙක කාමාවචර ජවන වීථි වලින් ස්වායත්තව ක්‍රියා කරයි", "isCorrect": false},
          {"text": "මෙම විදර්ශනා ඥාන ජවන වීථි තුළ ක්‍රියා කරන අතර, තදාරම්මණ සහ වෝට්ඨපන චිත්ත ඒවාට උපකාරක වේ", "isCorrect": true},
          {"text": "මෙම විදර්ශනා ඥාන වෝට්ඨපන චිත්ත තුළ පමණක් ක්‍රියා කරයි", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ විදර්ශනා ඥාන, කාමාවචර ජවන වීථි, සහ විවිධ චිත්ත ප්‍රකාර අතර ඇති සංකීර්ණ සම්බන්ධය අවබෝධ කරගෙන ඇත. නාම-රූප පරිච්ඡේද ඥානය සහ පච්චය පරිග්ගහ ඥානය යන විදර්ශනා ඥාන ජවන වීථි තුළ ක්‍රියා කරන අතර, තදාරම්මණ සහ වෝට්ඨපන චිත්ත ඒවාට උපකාරක වේ. වෝට්ඨපන චිත්තය අරමුණ තීරණය කිරීමෙන් විදර්ශනා ඥානයන්ට පදනම සකසයි, අතර තදාරම්මණ චිත්ත අරමුණේ බලපෑම දීර්ඝ කිරීමෙන් ගැඹුරු විශ්ලේෂණයට ඉඩ සලසයි.",
    "feedbackIncorrect": "වැරදියි. මෙය සංකීර්ණ ප්‍රශ්නයකි. නාම-රූප පරිච්ඡේද ඥානය සහ පච්චය පරිග්ගහ ඥානය යන විදර්ශනා ඥාන ජවන වීථි තුළ ක්‍රියා කරන අතර, තදාරම්මණ සහ වෝට්ඨපන චිත්ත ඒවාට උපකාරක වේ. මෙම විදර්ශනා ඥාන කාමාවචර ජවන වීථි වලින් ස්වායත්ත නොවන අතර, ඒවා එක් නිශ්චිත චිත්ත වර්ගයකට පමණක් සීමා නොවේ. මෙය අභිධර්මයේ සඳහන් වන චිත්ත වීථි ක්‍රියාවලියේ සංකීර්ණ ස්වභාවය පෙන්නුම් කරයි."},
  {
    "title": "ත්‍රිලක්ෂණය (අනිත්‍ය, දුක්ඛ, අනත්ත) සහ චතුරාර්ය සත්‍යය එකට සලකා බැලීමේදී, අභිධර්මයේ දැක්වෙන 'සප්පච්චය' සහ 'නිප්පච්චය' ධර්ම සංකල්ප ආශ්‍රයෙන්, නිර්වාණය සහ සංස්කෘත ධර්මයන් අතර ඇති සම්බන්ධය කෙසේ විග්‍රහ කළ හැකිද?",
    "required": true,
    "points": 2,
    "index": 128,
    "choices": [
          {"text": "නිර්වාණය සහ සංස්කෘත ධර්ම යන දෙකම සප්පච්චය වේ; මෙය දුක්ඛ සත්‍යයට අනුකූල වේ", "isCorrect": false},
          {"text": "නිර්වාණය සහ සංස්කෘත ධර්ම යන දෙකම නිප්පච්චය වේ; මෙය මග්ග සත්‍යයට අනුකූල වේ", "isCorrect": false},
          {"text": "නිර්වාණය නිප්පච්චය වන අතර සංස්කෘත ධර්ම සප්පච්චය වේ; මෙය ත්‍රිලක්ෂණයේ අනත්ත ලක්ෂණය සහ නිරෝධ සත්‍යය සමඟ සම්බන්ධ වේ", "isCorrect": true},
          {"text": "නිර්වාණය සප්පච්චය වන අතර සංස්කෘත ධර්ම නිප්පච්චය වේ; මෙය ත්‍රිලක්ෂණයේ අනිත්‍ය ලක්ෂණයට අනුකූල වේ", "isCorrect": false}],
    "feedbackCorrect": "නිවැරදියි! ඔබ අභිධර්මයේ ගැඹුරුතම සංකල්ප අතර ඇති සංකීර්ණ සම්බන්ධතා අවබෝධ කරගෙන ඇත. නිර්වාණය නිප්පච්චය (හේතු ප්‍රත්‍යය නොමැති) වන අතර සංස්කෘත ධර්ම සප්පච්චය (හේතු ප්‍රත්‍යය සහිත) වේ. මෙය ත්‍රිලක්ෂණයේ අනත්ත (ස්වයං-ස්වභාවයක් නැති) ලක්ෂණය සමඟ සම්බන්ධ වන අතර, නිරෝධ සත්‍යය (දුකෙහි නිරෝධය) සමඟ ද සම්බන්ධ වේ. මෙම අවබෝධය නිර්වාණයේ අසංස්කෘත ස්වභාවය සහ සියලු සංස්කාරයන්ගේ පටිච්චසමුප්පන්න ස්වභාවය පිළිබඳ ගැඹුරු අවබෝධයක් ලබා දෙයි.",
    "feedbackIncorrect": "වැරදියි. මෙය ඉතා සංකීර්ණ ප්‍රශ්නයකි. නිර්වාණය නිප්පච්චය (හේතු ප්‍රත්‍යය නොමැති) වන අතර සංස්කෘත ධර්ම සප්පච්චය (හේතු ප්‍රත්‍යය සහිත) වේ. මෙය ත්‍රිලක්ෂණයේ අනත්ත (ස්වයං-ස්වභාවයක් නැති) ලක්ෂණය සහ නිරෝධ සත්‍යය (දුකෙහි නිරෝධය) සමඟ සම්බන්ධ වේ. මෙම සංකල්ප අභිධර්මයේ ගැඹුරුතම ඉගැන්වීම් අතර වන අතර, නිර්වාණයේ අසංස්කෘත ස්වභාවය සහ සියලු සංස්කාරයන්ගේ පටිච්චසමුප්පන්න ස්වභාවය පිළිබඳ අවබෝධය සඳහා අත්‍යවශ්‍ය වේ."}];